zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_VFCCU_0.h
/*
 * Copyright 1997-2016 Freescale Semiconductor, Inc.
 * Copyright 2016-2025 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/*!
 * @file S32K566_VFCCU_0.h
 * @version 2.2
 * @date 2025-10-16
 * @brief Peripheral Access Layer for S32K566_VFCCU_0
 *
 * This file contains register definitions and macros for easy access to their
 * bit fields.
 *
 * This file assumes LITTLE endian system.
 */

/**
* @page misra_violations MISRA-C:2012 violations
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.3, local typedef not referenced
* The SoC header defines typedef for all modules.
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.5, local macro not referenced
* The SoC header defines macros for all modules and registers.
*
* @section [global]
* Violates MISRA 2012 Advisory Directive 4.9, Function-like macro
* These are generated macros used for accessing the bit-fields from registers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.1, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.2, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.4, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.5, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 21.1, defined macro '__I' is reserved to the compiler
* This type qualifier is needed to ensure correct I/O access and addressing.
*/

/* Prevention from multiple including the same memory map */
#if !defined(S32K566_VFCCU_0_H_)  /* Check if memory map has not been already included */
#define S32K566_VFCCU_0_H_

#include "S32K566_COMMON.h"

/* ----------------------------------------------------------------------------
   -- VFCCU_0 Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup VFCCU_0_Peripheral_Access_Layer VFCCU_0 Peripheral Access Layer
 * @{
 */

/** VFCCU_0 - Size of Registers Arrays */
#define VFCCU_0_GRKNTIMC_COUNT                    1u
#define VFCCU_0_GLB_EOUT_COUNT                    2u

/** VFCCU_0 - Register Layout Typedef */
typedef struct VFCCU_0_Struct {
  uint8_t RESERVED_0[768];
  __IO uint32_t GRKNTIMC[VFCCU_0_GRKNTIMC_COUNT];  /**< Global Reaction Timer Period, array offset: 0x300, array step: 0x4 */
  uint8_t RESERVED_1[316];
  __IO uint32_t GFLTRC_C0;                         /**< Global Fault Recovery, offset: 0x440 */
  __IO uint32_t GFLTRC_C1;                         /**< Global Fault Recovery, offset: 0x444 */
  uint8_t RESERVED_2[2232];
  __I  uint32_t GRKNTIMS;                          /**< Global Reaction Timer Status, offset: 0xD00 */
  uint8_t RESERVED_3[4];
  __I  uint32_t GINTOVFS;                          /**< Global DID FSM Status, offset: 0xD08 */
  uint8_t RESERVED_4[20];
  __IO uint32_t GMEOUTDC;                          /**< Global Minimum EOUT Duration, offset: 0xD20 */
  __IO uint32_t GEOUTTCT;                          /**< Global EOUT Timer Disable, offset: 0xD24 */
  uint8_t RESERVED_5[8];
  struct VFCCU_0_GLB_EOUT {                        /* offset: 0xD30, array step: 0x14 */
    __IO uint32_t GEOUTPNC;                          /**< Global EOUT Pin, array offset: 0xD30, array step: 0x14 */
    __IO uint32_t GEOUTPMC;                          /**< Global EOUT Pin Map, array offset: 0xD34, array step: 0x14 */
    __IO uint32_t GEOUTMC;                           /**< Global EOUT Mode, array offset: 0xD38, array step: 0x14 */
    __I  uint32_t GEOUTTMS;                          /**< Global EOUT Timer Status, array offset: 0xD3C, array step: 0x14 */
    __IO uint32_t GEOUTDIC;                          /**< Global EOUT DID, array offset: 0xD40, array step: 0x14 */
  } GLB_EOUT[VFCCU_0_GLB_EOUT_COUNT];
  uint8_t RESERVED_6[600];
  __IO uint32_t GDBGCFG;                           /**< Global Debug, offset: 0xFB0 */
  __I  uint32_t GDBGSTAT;                          /**< Global Debug Status, offset: 0xFB4 */
  __I  uint32_t GDPFSTAT;                          /**< Global Debug Pending Fault Status, offset: 0xFB8 */
  __I  uint32_t GDALTRLD;                          /**< Global Debug Alternate Reload Status, offset: 0xFBC */
  uint8_t RESERVED_7[64];
  __IO uint32_t FHCFG0;                            /**< Fault Handler, offset: 0x1000 */
  __I  uint32_t FHSRVDS0;                          /**< Fault Handler Status, offset: 0x1004 */
  uint8_t RESERVED_8[8];
  __IO uint32_t FHFLTENC0_0;                       /**< Fault Enable, offset: 0x1010 */
  __IO uint32_t FHFLTENC0_1;                       /**< Fault Enable, offset: 0x1014 */
  uint8_t RESERVED_9[56];
  __IO uint32_t FHFLTS0_0;                         /**< Fault Status, offset: 0x1050 */
  __IO uint32_t FHFLTS0_1;                         /**< Fault Status, offset: 0x1054 */
  uint8_t RESERVED_10[56];
  __IO uint32_t FHFLTRKC0_0;                       /**< Fault Reaction Set Configuration, offset: 0x1090 */
  __IO uint32_t FHFLTRKC0_1;                       /**< Fault Reaction Set Configuration, offset: 0x1094 */
  __IO uint32_t FHFLTRKC0_2;                       /**< Fault Reaction Set Configuration, offset: 0x1098 */
  __IO uint32_t FHFLTRKC0_3;                       /**< Fault Reaction Set Configuration, offset: 0x109C */
  __IO uint32_t FHFLTRKC0_4;                       /**< Fault Reaction Set Configuration, offset: 0x10A0 */
  __IO uint32_t FHFLTRKC0_5;                       /**< Fault Reaction Set Configuration, offset: 0x10A4 */
  __IO uint32_t FHFLTRKC0_6;                       /**< Fault Reaction Set Configuration, offset: 0x10A8 */
  __IO uint32_t FHFLTRKC0_7;                       /**< Fault Reaction Set Configuration, offset: 0x10AC */
  __IO uint32_t FHFLTRKC0_8;                       /**< Fault Reaction Set Configuration, offset: 0x10B0 */
  __IO uint32_t FHFLTRKC0_9;                       /**< Fault Reaction Set Configuration, offset: 0x10B4 */
  __IO uint32_t FHFLTRKC0_10;                      /**< Fault Reaction Set Configuration, offset: 0x10B8 */
  __IO uint32_t FHFLTRKC0_11;                      /**< Fault Reaction Set Configuration, offset: 0x10BC */
  __IO uint32_t FHFLTRKC0_12;                      /**< Fault Reaction Set Configuration, offset: 0x10C0 */
  __IO uint32_t FHFLTRKC0_13;                      /**< Fault Reaction Set Configuration, offset: 0x10C4 */
  __IO uint32_t FHFLTRKC0_14;                      /**< Fault Reaction Set Configuration, offset: 0x10C8 */
  __IO uint32_t FHFLTRKC0_15;                      /**< Fault Reaction Set Configuration, offset: 0x10CC */
  uint8_t RESERVED_11[448];
  __IO uint32_t FHIMRKC0_00;                       /**< Immediate Reaction Configuration, offset: 0x1290 */
  uint8_t RESERVED_12[12];
  __IO uint32_t FHDLRKC0_00;                       /**< Delayed Reaction Configuration, offset: 0x12A0 */
  uint8_t RESERVED_13[12];
  __IO uint32_t FHIMRKC0_10;                       /**< Immediate Reaction Configuration, offset: 0x12B0 */
  uint8_t RESERVED_14[12];
  __IO uint32_t FHDLRKC0_10;                       /**< Delayed Reaction Configuration, offset: 0x12C0 */
  uint8_t RESERVED_15[12];
  __IO uint32_t FHIMRKC0_20;                       /**< Immediate Reaction Configuration, offset: 0x12D0 */
  uint8_t RESERVED_16[12];
  __IO uint32_t FHDLRKC0_20;                       /**< Delayed Reaction Configuration, offset: 0x12E0 */
  uint8_t RESERVED_17[12];
  __IO uint32_t FHIMRKC0_30;                       /**< Immediate Reaction Configuration, offset: 0x12F0 */
  uint8_t RESERVED_18[12];
  __IO uint32_t FHDLRKC0_30;                       /**< Delayed Reaction Configuration, offset: 0x1300 */
  uint8_t RESERVED_19[12];
  __IO uint32_t FHIMRKC0_40;                       /**< Immediate Reaction Configuration, offset: 0x1310 */
  uint8_t RESERVED_20[12];
  __IO uint32_t FHDLRKC0_40;                       /**< Delayed Reaction Configuration, offset: 0x1320 */
  uint8_t RESERVED_21[12];
  __IO uint32_t FHIMRKC0_50;                       /**< Immediate Reaction Configuration, offset: 0x1330 */
  uint8_t RESERVED_22[12];
  __IO uint32_t FHDLRKC0_50;                       /**< Delayed Reaction Configuration, offset: 0x1340 */
  uint8_t RESERVED_23[12];
  __IO uint32_t FHIMRKC0_60;                       /**< Immediate Reaction Configuration, offset: 0x1350 */
  uint8_t RESERVED_24[12];
  __IO uint32_t FHDLRKC0_60;                       /**< Delayed Reaction Configuration, offset: 0x1360 */
  uint8_t RESERVED_25[12];
  __IO uint32_t FHIMRKC0_70;                       /**< Immediate Reaction Configuration, offset: 0x1370 */
  uint8_t RESERVED_26[12];
  __IO uint32_t FHDLRKC0_70;                       /**< Delayed Reaction Configuration, offset: 0x1380 */
  uint8_t RESERVED_27[12];
  __IO uint32_t FHIMRKC0_80;                       /**< Immediate Reaction Configuration, offset: 0x1390 */
  uint8_t RESERVED_28[12];
  __IO uint32_t FHDLRKC0_80;                       /**< Delayed Reaction Configuration, offset: 0x13A0 */
  uint8_t RESERVED_29[12];
  __IO uint32_t FHIMRKC0_90;                       /**< Immediate Reaction Configuration, offset: 0x13B0 */
  uint8_t RESERVED_30[12];
  __IO uint32_t FHDLRKC0_90;                       /**< Delayed Reaction Configuration, offset: 0x13C0 */
  uint8_t RESERVED_31[12];
  __IO uint32_t FHIMRKC0_100;                      /**< Immediate Reaction Configuration, offset: 0x13D0 */
  uint8_t RESERVED_32[12];
  __IO uint32_t FHDLRKC0_100;                      /**< Delayed Reaction Configuration, offset: 0x13E0 */
  uint8_t RESERVED_33[12];
  __IO uint32_t FHIMRKC0_110;                      /**< Immediate Reaction Configuration, offset: 0x13F0 */
  uint8_t RESERVED_34[12];
  __IO uint32_t FHDLRKC0_110;                      /**< Delayed Reaction Configuration, offset: 0x1400 */
  uint8_t RESERVED_35[12];
  __IO uint32_t FHIMRKC0_120;                      /**< Immediate Reaction Configuration, offset: 0x1410 */
  uint8_t RESERVED_36[12];
  __IO uint32_t FHDLRKC0_120;                      /**< Delayed Reaction Configuration, offset: 0x1420 */
  uint8_t RESERVED_37[12];
  __IO uint32_t FHIMRKC0_130;                      /**< Immediate Reaction Configuration, offset: 0x1430 */
  uint8_t RESERVED_38[12];
  __IO uint32_t FHDLRKC0_130;                      /**< Delayed Reaction Configuration, offset: 0x1440 */
  uint8_t RESERVED_39[12];
  __IO uint32_t FHIMRKC0_140;                      /**< Immediate Reaction Configuration, offset: 0x1450 */
  uint8_t RESERVED_40[12];
  __IO uint32_t FHDLRKC0_140;                      /**< Delayed Reaction Configuration, offset: 0x1460 */
  uint8_t RESERVED_41[12];
  __IO uint32_t FHIMRKC0_150;                      /**< Immediate Reaction Configuration, offset: 0x1470 */
  uint8_t RESERVED_42[12];
  __IO uint32_t FHDLRKC0_150;                      /**< Delayed Reaction Configuration, offset: 0x1480 */
} VFCCU_0_Type, *VFCCU_0_MemMapPtr;

/** Number of instances of the VFCCU_0 module. */
#define VFCCU_0_INSTANCE_COUNT                   (1u)

/* VFCCU_0 - Peripheral instance base addresses */
/** Peripheral VFCCU_0 base address */
#define IP_VFCCU_0_BASE                          (0x40B44000u)
/** Peripheral VFCCU_0 base pointer */
#define IP_VFCCU_0                               ((VFCCU_0_Type *)IP_VFCCU_0_BASE)
/** Array initializer of VFCCU_0 peripheral base addresses */
#define IP_VFCCU_0_BASE_ADDRS                    { IP_VFCCU_0_BASE }
/** Array initializer of VFCCU_0 peripheral base pointers */
#define IP_VFCCU_0_BASE_PTRS                     { IP_VFCCU_0 }

/* ----------------------------------------------------------------------------
   -- VFCCU_0 Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup VFCCU_0_Register_Masks VFCCU_0 Register Masks
 * @{
 */

/*! @name GRKNTIMC - Global Reaction Timer Period */
/*! @{ */

