zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_VFCCU_0.h
#define VFCCU_0_GRKNTIMC_RKTIMCFG_MASK           (0xFFFFFFFFU)
#define VFCCU_0_GRKNTIMC_RKTIMCFG_SHIFT          (0U)
#define VFCCU_0_GRKNTIMC_RKTIMCFG_WIDTH          (32U)
#define VFCCU_0_GRKNTIMC_RKTIMCFG(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_0_GRKNTIMC_RKTIMCFG_SHIFT)) & VFCCU_0_GRKNTIMC_RKTIMCFG_MASK)
/*! @} */

/*! @name GFLTRC_C0 - Global Fault Recovery */
/*! @{ */

#define VFCCU_0_GFLTRC_C0_RHWSW0_MASK            (0x1U)
#define VFCCU_0_GFLTRC_C0_RHWSW0_SHIFT           (0U)
#define VFCCU_0_GFLTRC_C0_RHWSW0_WIDTH           (1U)
#define VFCCU_0_GFLTRC_C0_RHWSW0(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_0_GFLTRC_C0_RHWSW0_SHIFT)) & VFCCU_0_GFLTRC_C0_RHWSW0_MASK)

#define VFCCU_0_GFLTRC_C0_RHWSW1_MASK            (0x2U)
#define VFCCU_0_GFLTRC_C0_RHWSW1_SHIFT           (1U)
#define VFCCU_0_GFLTRC_C0_RHWSW1_WIDTH           (1U)
#define VFCCU_0_GFLTRC_C0_RHWSW1(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_0_GFLTRC_C0_RHWSW1_SHIFT)) & VFCCU_0_GFLTRC_C0_RHWSW1_MASK)

#define VFCCU_0_GFLTRC_C0_RHWSW2_MASK            (0x4U)
#define VFCCU_0_GFLTRC_C0_RHWSW2_SHIFT           (2U)
#define VFCCU_0_GFLTRC_C0_RHWSW2_WIDTH           (1U)
#define VFCCU_0_GFLTRC_C0_RHWSW2(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_0_GFLTRC_C0_RHWSW2_SHIFT)) & VFCCU_0_GFLTRC_C0_RHWSW2_MASK)

#define VFCCU_0_GFLTRC_C0_RHWSW3_MASK            (0x8U)
#define VFCCU_0_GFLTRC_C0_RHWSW3_SHIFT           (3U)
#define VFCCU_0_GFLTRC_C0_RHWSW3_WIDTH           (1U)
#define VFCCU_0_GFLTRC_C0_RHWSW3(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_0_GFLTRC_C0_RHWSW3_SHIFT)) & VFCCU_0_GFLTRC_C0_RHWSW3_MASK)

#define VFCCU_0_GFLTRC_C0_RHWSW4_MASK            (0x10U)
#define VFCCU_0_GFLTRC_C0_RHWSW4_SHIFT           (4U)
#define VFCCU_0_GFLTRC_C0_RHWSW4_WIDTH           (1U)
#define VFCCU_0_GFLTRC_C0_RHWSW4(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_0_GFLTRC_C0_RHWSW4_SHIFT)) & VFCCU_0_GFLTRC_C0_RHWSW4_MASK)

#define VFCCU_0_GFLTRC_C0_RHWSW5_MASK            (0x20U)
#define VFCCU_0_GFLTRC_C0_RHWSW5_SHIFT           (5U)
#define VFCCU_0_GFLTRC_C0_RHWSW5_WIDTH           (1U)
#define VFCCU_0_GFLTRC_C0_RHWSW5(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_0_GFLTRC_C0_RHWSW5_SHIFT)) & VFCCU_0_GFLTRC_C0_RHWSW5_MASK)

#define VFCCU_0_GFLTRC_C0_RHWSW6_MASK            (0x40U)
#define VFCCU_0_GFLTRC_C0_RHWSW6_SHIFT           (6U)
#define VFCCU_0_GFLTRC_C0_RHWSW6_WIDTH           (1U)
#define VFCCU_0_GFLTRC_C0_RHWSW6(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_0_GFLTRC_C0_RHWSW6_SHIFT)) & VFCCU_0_GFLTRC_C0_RHWSW6_MASK)

#define VFCCU_0_GFLTRC_C0_RHWSW7_MASK            (0x80U)
#define VFCCU_0_GFLTRC_C0_RHWSW7_SHIFT           (7U)
#define VFCCU_0_GFLTRC_C0_RHWSW7_WIDTH           (1U)
#define VFCCU_0_GFLTRC_C0_RHWSW7(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_0_GFLTRC_C0_RHWSW7_SHIFT)) & VFCCU_0_GFLTRC_C0_RHWSW7_MASK)

#define VFCCU_0_GFLTRC_C0_RHWSW8_MASK            (0x100U)
#define VFCCU_0_GFLTRC_C0_RHWSW8_SHIFT           (8U)
#define VFCCU_0_GFLTRC_C0_RHWSW8_WIDTH           (1U)
#define VFCCU_0_GFLTRC_C0_RHWSW8(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_0_GFLTRC_C0_RHWSW8_SHIFT)) & VFCCU_0_GFLTRC_C0_RHWSW8_MASK)

#define VFCCU_0_GFLTRC_C0_RHWSW9_MASK            (0x200U)
#define VFCCU_0_GFLTRC_C0_RHWSW9_SHIFT           (9U)
#define VFCCU_0_GFLTRC_C0_RHWSW9_WIDTH           (1U)
#define VFCCU_0_GFLTRC_C0_RHWSW9(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_0_GFLTRC_C0_RHWSW9_SHIFT)) & VFCCU_0_GFLTRC_C0_RHWSW9_MASK)

#define VFCCU_0_GFLTRC_C0_RHWSW10_MASK           (0x400U)
#define VFCCU_0_GFLTRC_C0_RHWSW10_SHIFT          (10U)
#define VFCCU_0_GFLTRC_C0_RHWSW10_WIDTH          (1U)
#define VFCCU_0_GFLTRC_C0_RHWSW10(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_0_GFLTRC_C0_RHWSW10_SHIFT)) & VFCCU_0_GFLTRC_C0_RHWSW10_MASK)

#define VFCCU_0_GFLTRC_C0_RHWSW11_MASK           (0x800U)
#define VFCCU_0_GFLTRC_C0_RHWSW11_SHIFT          (11U)
#define VFCCU_0_GFLTRC_C0_RHWSW11_WIDTH          (1U)
#define VFCCU_0_GFLTRC_C0_RHWSW11(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_0_GFLTRC_C0_RHWSW11_SHIFT)) & VFCCU_0_GFLTRC_C0_RHWSW11_MASK)

#define VFCCU_0_GFLTRC_C0_RHWSW12_MASK           (0x1000U)
#define VFCCU_0_GFLTRC_C0_RHWSW12_SHIFT          (12U)
#define VFCCU_0_GFLTRC_C0_RHWSW12_WIDTH          (1U)
#define VFCCU_0_GFLTRC_C0_RHWSW12(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_0_GFLTRC_C0_RHWSW12_SHIFT)) & VFCCU_0_GFLTRC_C0_RHWSW12_MASK)

#define VFCCU_0_GFLTRC_C0_RHWSW13_MASK           (0x2000U)
#define VFCCU_0_GFLTRC_C0_RHWSW13_SHIFT          (13U)
#define VFCCU_0_GFLTRC_C0_RHWSW13_WIDTH          (1U)
#define VFCCU_0_GFLTRC_C0_RHWSW13(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_0_GFLTRC_C0_RHWSW13_SHIFT)) & VFCCU_0_GFLTRC_C0_RHWSW13_MASK)

#define VFCCU_0_GFLTRC_C0_RHWSW14_MASK           (0x4000U)
#define VFCCU_0_GFLTRC_C0_RHWSW14_SHIFT          (14U)
#define VFCCU_0_GFLTRC_C0_RHWSW14_WIDTH          (1U)
#define VFCCU_0_GFLTRC_C0_RHWSW14(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_0_GFLTRC_C0_RHWSW14_SHIFT)) & VFCCU_0_GFLTRC_C0_RHWSW14_MASK)

#define VFCCU_0_GFLTRC_C0_RHWSW15_MASK           (0x8000U)
#define VFCCU_0_GFLTRC_C0_RHWSW15_SHIFT          (15U)
#define VFCCU_0_GFLTRC_C0_RHWSW15_WIDTH          (1U)
#define VFCCU_0_GFLTRC_C0_RHWSW15(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_0_GFLTRC_C0_RHWSW15_SHIFT)) & VFCCU_0_GFLTRC_C0_RHWSW15_MASK)

#define VFCCU_0_GFLTRC_C0_RHWSW16_MASK           (0x10000U)
#define VFCCU_0_GFLTRC_C0_RHWSW16_SHIFT          (16U)
#define VFCCU_0_GFLTRC_C0_RHWSW16_WIDTH          (1U)
#define VFCCU_0_GFLTRC_C0_RHWSW16(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_0_GFLTRC_C0_RHWSW16_SHIFT)) & VFCCU_0_GFLTRC_C0_RHWSW16_MASK)

#define VFCCU_0_GFLTRC_C0_RHWSW17_MASK           (0x20000U)
#define VFCCU_0_GFLTRC_C0_RHWSW17_SHIFT          (17U)
#define VFCCU_0_GFLTRC_C0_RHWSW17_WIDTH          (1U)
#define VFCCU_0_GFLTRC_C0_RHWSW17(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_0_GFLTRC_C0_RHWSW17_SHIFT)) & VFCCU_0_GFLTRC_C0_RHWSW17_MASK)

#define VFCCU_0_GFLTRC_C0_RHWSW18_MASK           (0x40000U)
#define VFCCU_0_GFLTRC_C0_RHWSW18_SHIFT          (18U)
#define VFCCU_0_GFLTRC_C0_RHWSW18_WIDTH          (1U)
#define VFCCU_0_GFLTRC_C0_RHWSW18(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_0_GFLTRC_C0_RHWSW18_SHIFT)) & VFCCU_0_GFLTRC_C0_RHWSW18_MASK)

