zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_VFCCU_0.h
#define VFCCU_0_GFLTRC_C1_RHWSW62_MASK           (0x40000000U)
#define VFCCU_0_GFLTRC_C1_RHWSW62_SHIFT          (30U)
#define VFCCU_0_GFLTRC_C1_RHWSW62_WIDTH          (1U)
#define VFCCU_0_GFLTRC_C1_RHWSW62(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_0_GFLTRC_C1_RHWSW62_SHIFT)) & VFCCU_0_GFLTRC_C1_RHWSW62_MASK)

#define VFCCU_0_GFLTRC_C1_RHWSW63_MASK           (0x80000000U)
#define VFCCU_0_GFLTRC_C1_RHWSW63_SHIFT          (31U)
#define VFCCU_0_GFLTRC_C1_RHWSW63_WIDTH          (1U)
#define VFCCU_0_GFLTRC_C1_RHWSW63(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_0_GFLTRC_C1_RHWSW63_SHIFT)) & VFCCU_0_GFLTRC_C1_RHWSW63_MASK)
/*! @} */

/*! @name GRKNTIMS - Global Reaction Timer Status */
/*! @{ */

#define VFCCU_0_GRKNTIMS_RKTIMVAL_MASK           (0xFFFFFFFFU)
#define VFCCU_0_GRKNTIMS_RKTIMVAL_SHIFT          (0U)
#define VFCCU_0_GRKNTIMS_RKTIMVAL_WIDTH          (32U)
#define VFCCU_0_GRKNTIMS_RKTIMVAL(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_0_GRKNTIMS_RKTIMVAL_SHIFT)) & VFCCU_0_GRKNTIMS_RKTIMVAL_MASK)
/*! @} */

/*! @name GINTOVFS - Global DID FSM Status */
/*! @{ */

#define VFCCU_0_GINTOVFS_FSMSTATE_MASK           (0x3U)
#define VFCCU_0_GINTOVFS_FSMSTATE_SHIFT          (0U)
#define VFCCU_0_GINTOVFS_FSMSTATE_WIDTH          (2U)
#define VFCCU_0_GINTOVFS_FSMSTATE(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_0_GINTOVFS_FSMSTATE_SHIFT)) & VFCCU_0_GINTOVFS_FSMSTATE_MASK)

#define VFCCU_0_GINTOVFS_FLTSERV_MASK            (0x80U)
#define VFCCU_0_GINTOVFS_FLTSERV_SHIFT           (7U)
#define VFCCU_0_GINTOVFS_FLTSERV_WIDTH           (1U)
#define VFCCU_0_GINTOVFS_FLTSERV(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_0_GINTOVFS_FLTSERV_SHIFT)) & VFCCU_0_GINTOVFS_FLTSERV_MASK)

#define VFCCU_0_GINTOVFS_SERV_DID_MASK           (0xF0000U)
#define VFCCU_0_GINTOVFS_SERV_DID_SHIFT          (16U)
#define VFCCU_0_GINTOVFS_SERV_DID_WIDTH          (4U)
#define VFCCU_0_GINTOVFS_SERV_DID(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_0_GINTOVFS_SERV_DID_SHIFT)) & VFCCU_0_GINTOVFS_SERV_DID_MASK)
/*! @} */

/*! @name GMEOUTDC - Global Minimum EOUT Duration */
/*! @{ */

#define VFCCU_0_GMEOUTDC_EOUTMIND_MASK           (0xFFFFFFFFU)
#define VFCCU_0_GMEOUTDC_EOUTMIND_SHIFT          (0U)
#define VFCCU_0_GMEOUTDC_EOUTMIND_WIDTH          (32U)
#define VFCCU_0_GMEOUTDC_EOUTMIND(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_0_GMEOUTDC_EOUTMIND_SHIFT)) & VFCCU_0_GMEOUTDC_EOUTMIND_MASK)
/*! @} */

/*! @name GEOUTTCT - Global EOUT Timer Disable */
/*! @{ */

#define VFCCU_0_GEOUTTCT_TMRDIS0_MASK            (0x1U)
#define VFCCU_0_GEOUTTCT_TMRDIS0_SHIFT           (0U)
#define VFCCU_0_GEOUTTCT_TMRDIS0_WIDTH           (1U)
#define VFCCU_0_GEOUTTCT_TMRDIS0(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_0_GEOUTTCT_TMRDIS0_SHIFT)) & VFCCU_0_GEOUTTCT_TMRDIS0_MASK)

#define VFCCU_0_GEOUTTCT_TMRDIS1_MASK            (0x2U)
#define VFCCU_0_GEOUTTCT_TMRDIS1_SHIFT           (1U)
#define VFCCU_0_GEOUTTCT_TMRDIS1_WIDTH           (1U)
#define VFCCU_0_GEOUTTCT_TMRDIS1(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_0_GEOUTTCT_TMRDIS1_SHIFT)) & VFCCU_0_GEOUTTCT_TMRDIS1_MASK)
/*! @} */

/*! @name GEOUTPNC - Global EOUT Pin */
/*! @{ */

#define VFCCU_0_GEOUTPNC_OBE_VALID_MASK          (0x1U)
#define VFCCU_0_GEOUTPNC_OBE_VALID_SHIFT         (0U)
#define VFCCU_0_GEOUTPNC_OBE_VALID_WIDTH         (1U)
#define VFCCU_0_GEOUTPNC_OBE_VALID(x)            (((uint32_t)(((uint32_t)(x)) << VFCCU_0_GEOUTPNC_OBE_VALID_SHIFT)) & VFCCU_0_GEOUTPNC_OBE_VALID_MASK)

#define VFCCU_0_GEOUTPNC_OBE_STAT_MASK           (0x2U)
#define VFCCU_0_GEOUTPNC_OBE_STAT_SHIFT          (1U)
#define VFCCU_0_GEOUTPNC_OBE_STAT_WIDTH          (1U)
#define VFCCU_0_GEOUTPNC_OBE_STAT(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_0_GEOUTPNC_OBE_STAT_SHIFT)) & VFCCU_0_GEOUTPNC_OBE_STAT_MASK)

#define VFCCU_0_GEOUTPNC_DO_STAT_MASK            (0x8U)
#define VFCCU_0_GEOUTPNC_DO_STAT_SHIFT           (3U)
#define VFCCU_0_GEOUTPNC_DO_STAT_WIDTH           (1U)
#define VFCCU_0_GEOUTPNC_DO_STAT(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_0_GEOUTPNC_DO_STAT_SHIFT)) & VFCCU_0_GEOUTPNC_DO_STAT_MASK)

#define VFCCU_0_GEOUTPNC_VAL_CTRL_MASK           (0x30U)
#define VFCCU_0_GEOUTPNC_VAL_CTRL_SHIFT          (4U)
#define VFCCU_0_GEOUTPNC_VAL_CTRL_WIDTH          (2U)
#define VFCCU_0_GEOUTPNC_VAL_CTRL(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_0_GEOUTPNC_VAL_CTRL_SHIFT)) & VFCCU_0_GEOUTPNC_VAL_CTRL_MASK)

#define VFCCU_0_GEOUTPNC_IBE_MASK                (0x100U)
#define VFCCU_0_GEOUTPNC_IBE_SHIFT               (8U)
#define VFCCU_0_GEOUTPNC_IBE_WIDTH               (1U)
#define VFCCU_0_GEOUTPNC_IBE(x)                  (((uint32_t)(((uint32_t)(x)) << VFCCU_0_GEOUTPNC_IBE_SHIFT)) & VFCCU_0_GEOUTPNC_IBE_MASK)

#define VFCCU_0_GEOUTPNC_IND_STAT_MASK           (0x200U)
#define VFCCU_0_GEOUTPNC_IND_STAT_SHIFT          (9U)
#define VFCCU_0_GEOUTPNC_IND_STAT_WIDTH          (1U)
#define VFCCU_0_GEOUTPNC_IND_STAT(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_0_GEOUTPNC_IND_STAT_SHIFT)) & VFCCU_0_GEOUTPNC_IND_STAT_MASK)

#define VFCCU_0_GEOUTPNC_INV_IP_MASK             (0x400U)
#define VFCCU_0_GEOUTPNC_INV_IP_SHIFT            (10U)
#define VFCCU_0_GEOUTPNC_INV_IP_WIDTH            (1U)
#define VFCCU_0_GEOUTPNC_INV_IP(x)               (((uint32_t)(((uint32_t)(x)) << VFCCU_0_GEOUTPNC_INV_IP_SHIFT)) & VFCCU_0_GEOUTPNC_INV_IP_MASK)
/*! @} */

/*! @name GEOUTPMC - Global EOUT Pin Map */
/*! @{ */

#define VFCCU_0_GEOUTPMC_SPLENB0_MASK            (0x1U)
#define VFCCU_0_GEOUTPMC_SPLENB0_SHIFT           (0U)
#define VFCCU_0_GEOUTPMC_SPLENB0_WIDTH           (1U)
#define VFCCU_0_GEOUTPMC_SPLENB0(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_0_GEOUTPMC_SPLENB0_SHIFT)) & VFCCU_0_GEOUTPMC_SPLENB0_MASK)
/*! @} */

/*! @name GEOUTMC - Global EOUT Mode */
/*! @{ */

#define VFCCU_0_GEOUTMC_EOUTM_MASK               (0x7U)
#define VFCCU_0_GEOUTMC_EOUTM_SHIFT              (0U)
#define VFCCU_0_GEOUTMC_EOUTM_WIDTH              (3U)
#define VFCCU_0_GEOUTMC_EOUTM(x)                 (((uint32_t)(((uint32_t)(x)) << VFCCU_0_GEOUTMC_EOUTM_SHIFT)) & VFCCU_0_GEOUTMC_EOUTM_MASK)

#define VFCCU_0_GEOUTMC_INV_MASK                 (0x8U)
#define VFCCU_0_GEOUTMC_INV_SHIFT                (3U)
#define VFCCU_0_GEOUTMC_INV_WIDTH                (1U)
#define VFCCU_0_GEOUTMC_INV(x)                   (((uint32_t)(((uint32_t)(x)) << VFCCU_0_GEOUTMC_INV_SHIFT)) & VFCCU_0_GEOUTMC_INV_MASK)

#define VFCCU_0_GEOUTMC_TSM_CNT_MASK             (0xFFFFF00U)
#define VFCCU_0_GEOUTMC_TSM_CNT_SHIFT            (8U)
#define VFCCU_0_GEOUTMC_TSM_CNT_WIDTH            (20U)
#define VFCCU_0_GEOUTMC_TSM_CNT(x)               (((uint32_t)(((uint32_t)(x)) << VFCCU_0_GEOUTMC_TSM_CNT_SHIFT)) & VFCCU_0_GEOUTMC_TSM_CNT_MASK)
/*! @} */

/*! @name GEOUTTMS - Global EOUT Timer Status */
/*! @{ */

#define VFCCU_0_GEOUTTMS_EOUTDVAL_MASK           (0xFFFFFFFFU)
#define VFCCU_0_GEOUTTMS_EOUTDVAL_SHIFT          (0U)
#define VFCCU_0_GEOUTTMS_EOUTDVAL_WIDTH          (32U)
#define VFCCU_0_GEOUTTMS_EOUTDVAL(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_0_GEOUTTMS_EOUTDVAL_SHIFT)) & VFCCU_0_GEOUTTMS_EOUTDVAL_MASK)
/*! @} */

