zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_VFCCU_0.h
#define VFCCU_0_FHFLTENC0_0_EN15_MASK            (0x8000U)
#define VFCCU_0_FHFLTENC0_0_EN15_SHIFT           (15U)
#define VFCCU_0_FHFLTENC0_0_EN15_WIDTH           (1U)
#define VFCCU_0_FHFLTENC0_0_EN15(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHFLTENC0_0_EN15_SHIFT)) & VFCCU_0_FHFLTENC0_0_EN15_MASK)

#define VFCCU_0_FHFLTENC0_0_EN16_MASK            (0x10000U)
#define VFCCU_0_FHFLTENC0_0_EN16_SHIFT           (16U)
#define VFCCU_0_FHFLTENC0_0_EN16_WIDTH           (1U)
#define VFCCU_0_FHFLTENC0_0_EN16(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHFLTENC0_0_EN16_SHIFT)) & VFCCU_0_FHFLTENC0_0_EN16_MASK)

#define VFCCU_0_FHFLTENC0_0_EN17_MASK            (0x20000U)
#define VFCCU_0_FHFLTENC0_0_EN17_SHIFT           (17U)
#define VFCCU_0_FHFLTENC0_0_EN17_WIDTH           (1U)
#define VFCCU_0_FHFLTENC0_0_EN17(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHFLTENC0_0_EN17_SHIFT)) & VFCCU_0_FHFLTENC0_0_EN17_MASK)

#define VFCCU_0_FHFLTENC0_0_EN18_MASK            (0x40000U)
#define VFCCU_0_FHFLTENC0_0_EN18_SHIFT           (18U)
#define VFCCU_0_FHFLTENC0_0_EN18_WIDTH           (1U)
#define VFCCU_0_FHFLTENC0_0_EN18(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHFLTENC0_0_EN18_SHIFT)) & VFCCU_0_FHFLTENC0_0_EN18_MASK)

#define VFCCU_0_FHFLTENC0_0_EN19_MASK            (0x80000U)
#define VFCCU_0_FHFLTENC0_0_EN19_SHIFT           (19U)
#define VFCCU_0_FHFLTENC0_0_EN19_WIDTH           (1U)
#define VFCCU_0_FHFLTENC0_0_EN19(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHFLTENC0_0_EN19_SHIFT)) & VFCCU_0_FHFLTENC0_0_EN19_MASK)

#define VFCCU_0_FHFLTENC0_0_EN20_MASK            (0x100000U)
#define VFCCU_0_FHFLTENC0_0_EN20_SHIFT           (20U)
#define VFCCU_0_FHFLTENC0_0_EN20_WIDTH           (1U)
#define VFCCU_0_FHFLTENC0_0_EN20(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHFLTENC0_0_EN20_SHIFT)) & VFCCU_0_FHFLTENC0_0_EN20_MASK)

#define VFCCU_0_FHFLTENC0_0_EN21_MASK            (0x200000U)
#define VFCCU_0_FHFLTENC0_0_EN21_SHIFT           (21U)
#define VFCCU_0_FHFLTENC0_0_EN21_WIDTH           (1U)
#define VFCCU_0_FHFLTENC0_0_EN21(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHFLTENC0_0_EN21_SHIFT)) & VFCCU_0_FHFLTENC0_0_EN21_MASK)

#define VFCCU_0_FHFLTENC0_0_EN22_MASK            (0x400000U)
#define VFCCU_0_FHFLTENC0_0_EN22_SHIFT           (22U)
#define VFCCU_0_FHFLTENC0_0_EN22_WIDTH           (1U)
#define VFCCU_0_FHFLTENC0_0_EN22(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHFLTENC0_0_EN22_SHIFT)) & VFCCU_0_FHFLTENC0_0_EN22_MASK)

#define VFCCU_0_FHFLTENC0_0_EN23_MASK            (0x800000U)
#define VFCCU_0_FHFLTENC0_0_EN23_SHIFT           (23U)
#define VFCCU_0_FHFLTENC0_0_EN23_WIDTH           (1U)
#define VFCCU_0_FHFLTENC0_0_EN23(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHFLTENC0_0_EN23_SHIFT)) & VFCCU_0_FHFLTENC0_0_EN23_MASK)

#define VFCCU_0_FHFLTENC0_0_EN24_MASK            (0x1000000U)
#define VFCCU_0_FHFLTENC0_0_EN24_SHIFT           (24U)
#define VFCCU_0_FHFLTENC0_0_EN24_WIDTH           (1U)
#define VFCCU_0_FHFLTENC0_0_EN24(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHFLTENC0_0_EN24_SHIFT)) & VFCCU_0_FHFLTENC0_0_EN24_MASK)

#define VFCCU_0_FHFLTENC0_0_EN25_MASK            (0x2000000U)
#define VFCCU_0_FHFLTENC0_0_EN25_SHIFT           (25U)
#define VFCCU_0_FHFLTENC0_0_EN25_WIDTH           (1U)
#define VFCCU_0_FHFLTENC0_0_EN25(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHFLTENC0_0_EN25_SHIFT)) & VFCCU_0_FHFLTENC0_0_EN25_MASK)

#define VFCCU_0_FHFLTENC0_0_EN26_MASK            (0x4000000U)
#define VFCCU_0_FHFLTENC0_0_EN26_SHIFT           (26U)
#define VFCCU_0_FHFLTENC0_0_EN26_WIDTH           (1U)
#define VFCCU_0_FHFLTENC0_0_EN26(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHFLTENC0_0_EN26_SHIFT)) & VFCCU_0_FHFLTENC0_0_EN26_MASK)

#define VFCCU_0_FHFLTENC0_0_EN27_MASK            (0x8000000U)
#define VFCCU_0_FHFLTENC0_0_EN27_SHIFT           (27U)
#define VFCCU_0_FHFLTENC0_0_EN27_WIDTH           (1U)
#define VFCCU_0_FHFLTENC0_0_EN27(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHFLTENC0_0_EN27_SHIFT)) & VFCCU_0_FHFLTENC0_0_EN27_MASK)

#define VFCCU_0_FHFLTENC0_0_EN28_MASK            (0x10000000U)
#define VFCCU_0_FHFLTENC0_0_EN28_SHIFT           (28U)
#define VFCCU_0_FHFLTENC0_0_EN28_WIDTH           (1U)
#define VFCCU_0_FHFLTENC0_0_EN28(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHFLTENC0_0_EN28_SHIFT)) & VFCCU_0_FHFLTENC0_0_EN28_MASK)

#define VFCCU_0_FHFLTENC0_0_EN29_MASK            (0x20000000U)
#define VFCCU_0_FHFLTENC0_0_EN29_SHIFT           (29U)
#define VFCCU_0_FHFLTENC0_0_EN29_WIDTH           (1U)
#define VFCCU_0_FHFLTENC0_0_EN29(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHFLTENC0_0_EN29_SHIFT)) & VFCCU_0_FHFLTENC0_0_EN29_MASK)

#define VFCCU_0_FHFLTENC0_0_EN30_MASK            (0x40000000U)
#define VFCCU_0_FHFLTENC0_0_EN30_SHIFT           (30U)
#define VFCCU_0_FHFLTENC0_0_EN30_WIDTH           (1U)
#define VFCCU_0_FHFLTENC0_0_EN30(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHFLTENC0_0_EN30_SHIFT)) & VFCCU_0_FHFLTENC0_0_EN30_MASK)

#define VFCCU_0_FHFLTENC0_0_EN31_MASK            (0x80000000U)
#define VFCCU_0_FHFLTENC0_0_EN31_SHIFT           (31U)
#define VFCCU_0_FHFLTENC0_0_EN31_WIDTH           (1U)
#define VFCCU_0_FHFLTENC0_0_EN31(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHFLTENC0_0_EN31_SHIFT)) & VFCCU_0_FHFLTENC0_0_EN31_MASK)
/*! @} */

/*! @name FHFLTENC0_1 - Fault Enable */
/*! @{ */

#define VFCCU_0_FHFLTENC0_1_EN32_MASK            (0x1U)
#define VFCCU_0_FHFLTENC0_1_EN32_SHIFT           (0U)
#define VFCCU_0_FHFLTENC0_1_EN32_WIDTH           (1U)
#define VFCCU_0_FHFLTENC0_1_EN32(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHFLTENC0_1_EN32_SHIFT)) & VFCCU_0_FHFLTENC0_1_EN32_MASK)

#define VFCCU_0_FHFLTENC0_1_EN33_MASK            (0x2U)
#define VFCCU_0_FHFLTENC0_1_EN33_SHIFT           (1U)
#define VFCCU_0_FHFLTENC0_1_EN33_WIDTH           (1U)
#define VFCCU_0_FHFLTENC0_1_EN33(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHFLTENC0_1_EN33_SHIFT)) & VFCCU_0_FHFLTENC0_1_EN33_MASK)

#define VFCCU_0_FHFLTENC0_1_EN34_MASK            (0x4U)
#define VFCCU_0_FHFLTENC0_1_EN34_SHIFT           (2U)
#define VFCCU_0_FHFLTENC0_1_EN34_WIDTH           (1U)
#define VFCCU_0_FHFLTENC0_1_EN34(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHFLTENC0_1_EN34_SHIFT)) & VFCCU_0_FHFLTENC0_1_EN34_MASK)

#define VFCCU_0_FHFLTENC0_1_EN35_MASK            (0x8U)
#define VFCCU_0_FHFLTENC0_1_EN35_SHIFT           (3U)
#define VFCCU_0_FHFLTENC0_1_EN35_WIDTH           (1U)
#define VFCCU_0_FHFLTENC0_1_EN35(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHFLTENC0_1_EN35_SHIFT)) & VFCCU_0_FHFLTENC0_1_EN35_MASK)

#define VFCCU_0_FHFLTENC0_1_EN36_MASK            (0x10U)
#define VFCCU_0_FHFLTENC0_1_EN36_SHIFT           (4U)
#define VFCCU_0_FHFLTENC0_1_EN36_WIDTH           (1U)
#define VFCCU_0_FHFLTENC0_1_EN36(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHFLTENC0_1_EN36_SHIFT)) & VFCCU_0_FHFLTENC0_1_EN36_MASK)

#define VFCCU_0_FHFLTENC0_1_EN37_MASK            (0x20U)
#define VFCCU_0_FHFLTENC0_1_EN37_SHIFT           (5U)
#define VFCCU_0_FHFLTENC0_1_EN37_WIDTH           (1U)
#define VFCCU_0_FHFLTENC0_1_EN37(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHFLTENC0_1_EN37_SHIFT)) & VFCCU_0_FHFLTENC0_1_EN37_MASK)

#define VFCCU_0_FHFLTENC0_1_EN38_MASK            (0x40U)
#define VFCCU_0_FHFLTENC0_1_EN38_SHIFT           (6U)
#define VFCCU_0_FHFLTENC0_1_EN38_WIDTH           (1U)
#define VFCCU_0_FHFLTENC0_1_EN38(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHFLTENC0_1_EN38_SHIFT)) & VFCCU_0_FHFLTENC0_1_EN38_MASK)

#define VFCCU_0_FHFLTENC0_1_EN39_MASK            (0x80U)
#define VFCCU_0_FHFLTENC0_1_EN39_SHIFT           (7U)
#define VFCCU_0_FHFLTENC0_1_EN39_WIDTH           (1U)
#define VFCCU_0_FHFLTENC0_1_EN39(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHFLTENC0_1_EN39_SHIFT)) & VFCCU_0_FHFLTENC0_1_EN39_MASK)

#define VFCCU_0_FHFLTENC0_1_EN40_MASK            (0x100U)
#define VFCCU_0_FHFLTENC0_1_EN40_SHIFT           (8U)
#define VFCCU_0_FHFLTENC0_1_EN40_WIDTH           (1U)
#define VFCCU_0_FHFLTENC0_1_EN40(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHFLTENC0_1_EN40_SHIFT)) & VFCCU_0_FHFLTENC0_1_EN40_MASK)

#define VFCCU_0_FHFLTENC0_1_EN41_MASK            (0x200U)
#define VFCCU_0_FHFLTENC0_1_EN41_SHIFT           (9U)
#define VFCCU_0_FHFLTENC0_1_EN41_WIDTH           (1U)
#define VFCCU_0_FHFLTENC0_1_EN41(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHFLTENC0_1_EN41_SHIFT)) & VFCCU_0_FHFLTENC0_1_EN41_MASK)

#define VFCCU_0_FHFLTENC0_1_EN42_MASK            (0x400U)
#define VFCCU_0_FHFLTENC0_1_EN42_SHIFT           (10U)
#define VFCCU_0_FHFLTENC0_1_EN42_WIDTH           (1U)
#define VFCCU_0_FHFLTENC0_1_EN42(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHFLTENC0_1_EN42_SHIFT)) & VFCCU_0_FHFLTENC0_1_EN42_MASK)

#define VFCCU_0_FHFLTENC0_1_EN43_MASK            (0x800U)
#define VFCCU_0_FHFLTENC0_1_EN43_SHIFT           (11U)
#define VFCCU_0_FHFLTENC0_1_EN43_WIDTH           (1U)
#define VFCCU_0_FHFLTENC0_1_EN43(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHFLTENC0_1_EN43_SHIFT)) & VFCCU_0_FHFLTENC0_1_EN43_MASK)

#define VFCCU_0_FHFLTENC0_1_EN44_MASK            (0x1000U)
#define VFCCU_0_FHFLTENC0_1_EN44_SHIFT           (12U)
#define VFCCU_0_FHFLTENC0_1_EN44_WIDTH           (1U)
#define VFCCU_0_FHFLTENC0_1_EN44(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHFLTENC0_1_EN44_SHIFT)) & VFCCU_0_FHFLTENC0_1_EN44_MASK)

#define VFCCU_0_FHFLTENC0_1_EN45_MASK            (0x2000U)
#define VFCCU_0_FHFLTENC0_1_EN45_SHIFT           (13U)
#define VFCCU_0_FHFLTENC0_1_EN45_WIDTH           (1U)
#define VFCCU_0_FHFLTENC0_1_EN45(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHFLTENC0_1_EN45_SHIFT)) & VFCCU_0_FHFLTENC0_1_EN45_MASK)

#define VFCCU_0_FHFLTENC0_1_EN46_MASK            (0x4000U)
#define VFCCU_0_FHFLTENC0_1_EN46_SHIFT           (14U)
#define VFCCU_0_FHFLTENC0_1_EN46_WIDTH           (1U)
#define VFCCU_0_FHFLTENC0_1_EN46(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHFLTENC0_1_EN46_SHIFT)) & VFCCU_0_FHFLTENC0_1_EN46_MASK)

#define VFCCU_0_FHFLTENC0_1_EN47_MASK            (0x8000U)
#define VFCCU_0_FHFLTENC0_1_EN47_SHIFT           (15U)
#define VFCCU_0_FHFLTENC0_1_EN47_WIDTH           (1U)
#define VFCCU_0_FHFLTENC0_1_EN47(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHFLTENC0_1_EN47_SHIFT)) & VFCCU_0_FHFLTENC0_1_EN47_MASK)

#define VFCCU_0_FHFLTENC0_1_EN48_MASK            (0x10000U)
#define VFCCU_0_FHFLTENC0_1_EN48_SHIFT           (16U)
#define VFCCU_0_FHFLTENC0_1_EN48_WIDTH           (1U)
#define VFCCU_0_FHFLTENC0_1_EN48(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHFLTENC0_1_EN48_SHIFT)) & VFCCU_0_FHFLTENC0_1_EN48_MASK)

#define VFCCU_0_FHFLTENC0_1_EN49_MASK            (0x20000U)
#define VFCCU_0_FHFLTENC0_1_EN49_SHIFT           (17U)
#define VFCCU_0_FHFLTENC0_1_EN49_WIDTH           (1U)
#define VFCCU_0_FHFLTENC0_1_EN49(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHFLTENC0_1_EN49_SHIFT)) & VFCCU_0_FHFLTENC0_1_EN49_MASK)

#define VFCCU_0_FHFLTENC0_1_EN50_MASK            (0x40000U)
#define VFCCU_0_FHFLTENC0_1_EN50_SHIFT           (18U)
#define VFCCU_0_FHFLTENC0_1_EN50_WIDTH           (1U)
#define VFCCU_0_FHFLTENC0_1_EN50(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHFLTENC0_1_EN50_SHIFT)) & VFCCU_0_FHFLTENC0_1_EN50_MASK)

#define VFCCU_0_FHFLTENC0_1_EN51_MASK            (0x80000U)
#define VFCCU_0_FHFLTENC0_1_EN51_SHIFT           (19U)
#define VFCCU_0_FHFLTENC0_1_EN51_WIDTH           (1U)
#define VFCCU_0_FHFLTENC0_1_EN51(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHFLTENC0_1_EN51_SHIFT)) & VFCCU_0_FHFLTENC0_1_EN51_MASK)

#define VFCCU_0_FHFLTENC0_1_EN52_MASK            (0x100000U)
#define VFCCU_0_FHFLTENC0_1_EN52_SHIFT           (20U)
#define VFCCU_0_FHFLTENC0_1_EN52_WIDTH           (1U)
#define VFCCU_0_FHFLTENC0_1_EN52(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHFLTENC0_1_EN52_SHIFT)) & VFCCU_0_FHFLTENC0_1_EN52_MASK)

#define VFCCU_0_FHFLTENC0_1_EN53_MASK            (0x200000U)
#define VFCCU_0_FHFLTENC0_1_EN53_SHIFT           (21U)
#define VFCCU_0_FHFLTENC0_1_EN53_WIDTH           (1U)
#define VFCCU_0_FHFLTENC0_1_EN53(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHFLTENC0_1_EN53_SHIFT)) & VFCCU_0_FHFLTENC0_1_EN53_MASK)

