zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_VFCCU_0.h
#define VFCCU_0_FHFLTENC0_1_EN54_MASK            (0x400000U)
#define VFCCU_0_FHFLTENC0_1_EN54_SHIFT           (22U)
#define VFCCU_0_FHFLTENC0_1_EN54_WIDTH           (1U)
#define VFCCU_0_FHFLTENC0_1_EN54(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHFLTENC0_1_EN54_SHIFT)) & VFCCU_0_FHFLTENC0_1_EN54_MASK)

#define VFCCU_0_FHFLTENC0_1_EN55_MASK            (0x800000U)
#define VFCCU_0_FHFLTENC0_1_EN55_SHIFT           (23U)
#define VFCCU_0_FHFLTENC0_1_EN55_WIDTH           (1U)
#define VFCCU_0_FHFLTENC0_1_EN55(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHFLTENC0_1_EN55_SHIFT)) & VFCCU_0_FHFLTENC0_1_EN55_MASK)

#define VFCCU_0_FHFLTENC0_1_EN56_MASK            (0x1000000U)
#define VFCCU_0_FHFLTENC0_1_EN56_SHIFT           (24U)
#define VFCCU_0_FHFLTENC0_1_EN56_WIDTH           (1U)
#define VFCCU_0_FHFLTENC0_1_EN56(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHFLTENC0_1_EN56_SHIFT)) & VFCCU_0_FHFLTENC0_1_EN56_MASK)

#define VFCCU_0_FHFLTENC0_1_EN57_MASK            (0x2000000U)
#define VFCCU_0_FHFLTENC0_1_EN57_SHIFT           (25U)
#define VFCCU_0_FHFLTENC0_1_EN57_WIDTH           (1U)
#define VFCCU_0_FHFLTENC0_1_EN57(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHFLTENC0_1_EN57_SHIFT)) & VFCCU_0_FHFLTENC0_1_EN57_MASK)

#define VFCCU_0_FHFLTENC0_1_EN58_MASK            (0x4000000U)
#define VFCCU_0_FHFLTENC0_1_EN58_SHIFT           (26U)
#define VFCCU_0_FHFLTENC0_1_EN58_WIDTH           (1U)
#define VFCCU_0_FHFLTENC0_1_EN58(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHFLTENC0_1_EN58_SHIFT)) & VFCCU_0_FHFLTENC0_1_EN58_MASK)

#define VFCCU_0_FHFLTENC0_1_EN59_MASK            (0x8000000U)
#define VFCCU_0_FHFLTENC0_1_EN59_SHIFT           (27U)
#define VFCCU_0_FHFLTENC0_1_EN59_WIDTH           (1U)
#define VFCCU_0_FHFLTENC0_1_EN59(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHFLTENC0_1_EN59_SHIFT)) & VFCCU_0_FHFLTENC0_1_EN59_MASK)

#define VFCCU_0_FHFLTENC0_1_EN60_MASK            (0x10000000U)
#define VFCCU_0_FHFLTENC0_1_EN60_SHIFT           (28U)
#define VFCCU_0_FHFLTENC0_1_EN60_WIDTH           (1U)
#define VFCCU_0_FHFLTENC0_1_EN60(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHFLTENC0_1_EN60_SHIFT)) & VFCCU_0_FHFLTENC0_1_EN60_MASK)

#define VFCCU_0_FHFLTENC0_1_EN61_MASK            (0x20000000U)
#define VFCCU_0_FHFLTENC0_1_EN61_SHIFT           (29U)
#define VFCCU_0_FHFLTENC0_1_EN61_WIDTH           (1U)
#define VFCCU_0_FHFLTENC0_1_EN61(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHFLTENC0_1_EN61_SHIFT)) & VFCCU_0_FHFLTENC0_1_EN61_MASK)

#define VFCCU_0_FHFLTENC0_1_EN62_MASK            (0x40000000U)
#define VFCCU_0_FHFLTENC0_1_EN62_SHIFT           (30U)
#define VFCCU_0_FHFLTENC0_1_EN62_WIDTH           (1U)
#define VFCCU_0_FHFLTENC0_1_EN62(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHFLTENC0_1_EN62_SHIFT)) & VFCCU_0_FHFLTENC0_1_EN62_MASK)

#define VFCCU_0_FHFLTENC0_1_EN63_MASK            (0x80000000U)
#define VFCCU_0_FHFLTENC0_1_EN63_SHIFT           (31U)
#define VFCCU_0_FHFLTENC0_1_EN63_WIDTH           (1U)
#define VFCCU_0_FHFLTENC0_1_EN63(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHFLTENC0_1_EN63_SHIFT)) & VFCCU_0_FHFLTENC0_1_EN63_MASK)
/*! @} */

/*! @name FHFLTS0_0 - Fault Status */
/*! @{ */

#define VFCCU_0_FHFLTS0_0_STAT0_MASK             (0x1U)
#define VFCCU_0_FHFLTS0_0_STAT0_SHIFT            (0U)
#define VFCCU_0_FHFLTS0_0_STAT0_WIDTH            (1U)
#define VFCCU_0_FHFLTS0_0_STAT0(x)               (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHFLTS0_0_STAT0_SHIFT)) & VFCCU_0_FHFLTS0_0_STAT0_MASK)

#define VFCCU_0_FHFLTS0_0_STAT1_MASK             (0x2U)
#define VFCCU_0_FHFLTS0_0_STAT1_SHIFT            (1U)
#define VFCCU_0_FHFLTS0_0_STAT1_WIDTH            (1U)
#define VFCCU_0_FHFLTS0_0_STAT1(x)               (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHFLTS0_0_STAT1_SHIFT)) & VFCCU_0_FHFLTS0_0_STAT1_MASK)

#define VFCCU_0_FHFLTS0_0_STAT2_MASK             (0x4U)
#define VFCCU_0_FHFLTS0_0_STAT2_SHIFT            (2U)
#define VFCCU_0_FHFLTS0_0_STAT2_WIDTH            (1U)
#define VFCCU_0_FHFLTS0_0_STAT2(x)               (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHFLTS0_0_STAT2_SHIFT)) & VFCCU_0_FHFLTS0_0_STAT2_MASK)

#define VFCCU_0_FHFLTS0_0_STAT3_MASK             (0x8U)
#define VFCCU_0_FHFLTS0_0_STAT3_SHIFT            (3U)
#define VFCCU_0_FHFLTS0_0_STAT3_WIDTH            (1U)
#define VFCCU_0_FHFLTS0_0_STAT3(x)               (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHFLTS0_0_STAT3_SHIFT)) & VFCCU_0_FHFLTS0_0_STAT3_MASK)

#define VFCCU_0_FHFLTS0_0_STAT4_MASK             (0x10U)
#define VFCCU_0_FHFLTS0_0_STAT4_SHIFT            (4U)
#define VFCCU_0_FHFLTS0_0_STAT4_WIDTH            (1U)
#define VFCCU_0_FHFLTS0_0_STAT4(x)               (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHFLTS0_0_STAT4_SHIFT)) & VFCCU_0_FHFLTS0_0_STAT4_MASK)

#define VFCCU_0_FHFLTS0_0_STAT5_MASK             (0x20U)
#define VFCCU_0_FHFLTS0_0_STAT5_SHIFT            (5U)
#define VFCCU_0_FHFLTS0_0_STAT5_WIDTH            (1U)
#define VFCCU_0_FHFLTS0_0_STAT5(x)               (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHFLTS0_0_STAT5_SHIFT)) & VFCCU_0_FHFLTS0_0_STAT5_MASK)

#define VFCCU_0_FHFLTS0_0_STAT6_MASK             (0x40U)
#define VFCCU_0_FHFLTS0_0_STAT6_SHIFT            (6U)
#define VFCCU_0_FHFLTS0_0_STAT6_WIDTH            (1U)
#define VFCCU_0_FHFLTS0_0_STAT6(x)               (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHFLTS0_0_STAT6_SHIFT)) & VFCCU_0_FHFLTS0_0_STAT6_MASK)

#define VFCCU_0_FHFLTS0_0_STAT7_MASK             (0x80U)
#define VFCCU_0_FHFLTS0_0_STAT7_SHIFT            (7U)
#define VFCCU_0_FHFLTS0_0_STAT7_WIDTH            (1U)
#define VFCCU_0_FHFLTS0_0_STAT7(x)               (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHFLTS0_0_STAT7_SHIFT)) & VFCCU_0_FHFLTS0_0_STAT7_MASK)

#define VFCCU_0_FHFLTS0_0_STAT8_MASK             (0x100U)
#define VFCCU_0_FHFLTS0_0_STAT8_SHIFT            (8U)
#define VFCCU_0_FHFLTS0_0_STAT8_WIDTH            (1U)
#define VFCCU_0_FHFLTS0_0_STAT8(x)               (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHFLTS0_0_STAT8_SHIFT)) & VFCCU_0_FHFLTS0_0_STAT8_MASK)

#define VFCCU_0_FHFLTS0_0_STAT9_MASK             (0x200U)
#define VFCCU_0_FHFLTS0_0_STAT9_SHIFT            (9U)
#define VFCCU_0_FHFLTS0_0_STAT9_WIDTH            (1U)
#define VFCCU_0_FHFLTS0_0_STAT9(x)               (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHFLTS0_0_STAT9_SHIFT)) & VFCCU_0_FHFLTS0_0_STAT9_MASK)

#define VFCCU_0_FHFLTS0_0_STAT10_MASK            (0x400U)
#define VFCCU_0_FHFLTS0_0_STAT10_SHIFT           (10U)
#define VFCCU_0_FHFLTS0_0_STAT10_WIDTH           (1U)
#define VFCCU_0_FHFLTS0_0_STAT10(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHFLTS0_0_STAT10_SHIFT)) & VFCCU_0_FHFLTS0_0_STAT10_MASK)

#define VFCCU_0_FHFLTS0_0_STAT11_MASK            (0x800U)
#define VFCCU_0_FHFLTS0_0_STAT11_SHIFT           (11U)
#define VFCCU_0_FHFLTS0_0_STAT11_WIDTH           (1U)
#define VFCCU_0_FHFLTS0_0_STAT11(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHFLTS0_0_STAT11_SHIFT)) & VFCCU_0_FHFLTS0_0_STAT11_MASK)

#define VFCCU_0_FHFLTS0_0_STAT12_MASK            (0x1000U)
#define VFCCU_0_FHFLTS0_0_STAT12_SHIFT           (12U)
#define VFCCU_0_FHFLTS0_0_STAT12_WIDTH           (1U)
#define VFCCU_0_FHFLTS0_0_STAT12(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHFLTS0_0_STAT12_SHIFT)) & VFCCU_0_FHFLTS0_0_STAT12_MASK)

