zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_VFCCU_0.h
#define VFCCU_0_FHFLTS0_1_STAT55_MASK            (0x800000U)
#define VFCCU_0_FHFLTS0_1_STAT55_SHIFT           (23U)
#define VFCCU_0_FHFLTS0_1_STAT55_WIDTH           (1U)
#define VFCCU_0_FHFLTS0_1_STAT55(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHFLTS0_1_STAT55_SHIFT)) & VFCCU_0_FHFLTS0_1_STAT55_MASK)

#define VFCCU_0_FHFLTS0_1_STAT56_MASK            (0x1000000U)
#define VFCCU_0_FHFLTS0_1_STAT56_SHIFT           (24U)
#define VFCCU_0_FHFLTS0_1_STAT56_WIDTH           (1U)
#define VFCCU_0_FHFLTS0_1_STAT56(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHFLTS0_1_STAT56_SHIFT)) & VFCCU_0_FHFLTS0_1_STAT56_MASK)

#define VFCCU_0_FHFLTS0_1_STAT57_MASK            (0x2000000U)
#define VFCCU_0_FHFLTS0_1_STAT57_SHIFT           (25U)
#define VFCCU_0_FHFLTS0_1_STAT57_WIDTH           (1U)
#define VFCCU_0_FHFLTS0_1_STAT57(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHFLTS0_1_STAT57_SHIFT)) & VFCCU_0_FHFLTS0_1_STAT57_MASK)

#define VFCCU_0_FHFLTS0_1_STAT58_MASK            (0x4000000U)
#define VFCCU_0_FHFLTS0_1_STAT58_SHIFT           (26U)
#define VFCCU_0_FHFLTS0_1_STAT58_WIDTH           (1U)
#define VFCCU_0_FHFLTS0_1_STAT58(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHFLTS0_1_STAT58_SHIFT)) & VFCCU_0_FHFLTS0_1_STAT58_MASK)

#define VFCCU_0_FHFLTS0_1_STAT59_MASK            (0x8000000U)
#define VFCCU_0_FHFLTS0_1_STAT59_SHIFT           (27U)
#define VFCCU_0_FHFLTS0_1_STAT59_WIDTH           (1U)
#define VFCCU_0_FHFLTS0_1_STAT59(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHFLTS0_1_STAT59_SHIFT)) & VFCCU_0_FHFLTS0_1_STAT59_MASK)

#define VFCCU_0_FHFLTS0_1_STAT60_MASK            (0x10000000U)
#define VFCCU_0_FHFLTS0_1_STAT60_SHIFT           (28U)
#define VFCCU_0_FHFLTS0_1_STAT60_WIDTH           (1U)
#define VFCCU_0_FHFLTS0_1_STAT60(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHFLTS0_1_STAT60_SHIFT)) & VFCCU_0_FHFLTS0_1_STAT60_MASK)

#define VFCCU_0_FHFLTS0_1_STAT61_MASK            (0x20000000U)
#define VFCCU_0_FHFLTS0_1_STAT61_SHIFT           (29U)
#define VFCCU_0_FHFLTS0_1_STAT61_WIDTH           (1U)
#define VFCCU_0_FHFLTS0_1_STAT61(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHFLTS0_1_STAT61_SHIFT)) & VFCCU_0_FHFLTS0_1_STAT61_MASK)

#define VFCCU_0_FHFLTS0_1_STAT62_MASK            (0x40000000U)
#define VFCCU_0_FHFLTS0_1_STAT62_SHIFT           (30U)
#define VFCCU_0_FHFLTS0_1_STAT62_WIDTH           (1U)
#define VFCCU_0_FHFLTS0_1_STAT62(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHFLTS0_1_STAT62_SHIFT)) & VFCCU_0_FHFLTS0_1_STAT62_MASK)

#define VFCCU_0_FHFLTS0_1_STAT63_MASK            (0x80000000U)
#define VFCCU_0_FHFLTS0_1_STAT63_SHIFT           (31U)
#define VFCCU_0_FHFLTS0_1_STAT63_WIDTH           (1U)
#define VFCCU_0_FHFLTS0_1_STAT63(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHFLTS0_1_STAT63_SHIFT)) & VFCCU_0_FHFLTS0_1_STAT63_MASK)
/*! @} */

/*! @name FHFLTRKC0_0 - Fault Reaction Set Configuration */
/*! @{ */

#define VFCCU_0_FHFLTRKC0_0_RKNSEL0_MASK         (0xFU)
#define VFCCU_0_FHFLTRKC0_0_RKNSEL0_SHIFT        (0U)
#define VFCCU_0_FHFLTRKC0_0_RKNSEL0_WIDTH        (4U)
#define VFCCU_0_FHFLTRKC0_0_RKNSEL0(x)           (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHFLTRKC0_0_RKNSEL0_SHIFT)) & VFCCU_0_FHFLTRKC0_0_RKNSEL0_MASK)

#define VFCCU_0_FHFLTRKC0_0_RKNSEL1_MASK         (0xF00U)
#define VFCCU_0_FHFLTRKC0_0_RKNSEL1_SHIFT        (8U)
#define VFCCU_0_FHFLTRKC0_0_RKNSEL1_WIDTH        (4U)
#define VFCCU_0_FHFLTRKC0_0_RKNSEL1(x)           (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHFLTRKC0_0_RKNSEL1_SHIFT)) & VFCCU_0_FHFLTRKC0_0_RKNSEL1_MASK)

#define VFCCU_0_FHFLTRKC0_0_RKNSEL2_MASK         (0xF0000U)
#define VFCCU_0_FHFLTRKC0_0_RKNSEL2_SHIFT        (16U)
#define VFCCU_0_FHFLTRKC0_0_RKNSEL2_WIDTH        (4U)
#define VFCCU_0_FHFLTRKC0_0_RKNSEL2(x)           (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHFLTRKC0_0_RKNSEL2_SHIFT)) & VFCCU_0_FHFLTRKC0_0_RKNSEL2_MASK)

#define VFCCU_0_FHFLTRKC0_0_RKNSEL3_MASK         (0xF000000U)
#define VFCCU_0_FHFLTRKC0_0_RKNSEL3_SHIFT        (24U)
#define VFCCU_0_FHFLTRKC0_0_RKNSEL3_WIDTH        (4U)
#define VFCCU_0_FHFLTRKC0_0_RKNSEL3(x)           (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHFLTRKC0_0_RKNSEL3_SHIFT)) & VFCCU_0_FHFLTRKC0_0_RKNSEL3_MASK)
/*! @} */

/*! @name FHFLTRKC0_1 - Fault Reaction Set Configuration */
/*! @{ */

#define VFCCU_0_FHFLTRKC0_1_RKNSEL4_MASK         (0xFU)
#define VFCCU_0_FHFLTRKC0_1_RKNSEL4_SHIFT        (0U)
#define VFCCU_0_FHFLTRKC0_1_RKNSEL4_WIDTH        (4U)
#define VFCCU_0_FHFLTRKC0_1_RKNSEL4(x)           (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHFLTRKC0_1_RKNSEL4_SHIFT)) & VFCCU_0_FHFLTRKC0_1_RKNSEL4_MASK)

#define VFCCU_0_FHFLTRKC0_1_RKNSEL5_MASK         (0xF00U)
#define VFCCU_0_FHFLTRKC0_1_RKNSEL5_SHIFT        (8U)
#define VFCCU_0_FHFLTRKC0_1_RKNSEL5_WIDTH        (4U)
#define VFCCU_0_FHFLTRKC0_1_RKNSEL5(x)           (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHFLTRKC0_1_RKNSEL5_SHIFT)) & VFCCU_0_FHFLTRKC0_1_RKNSEL5_MASK)

#define VFCCU_0_FHFLTRKC0_1_RKNSEL6_MASK         (0xF0000U)
#define VFCCU_0_FHFLTRKC0_1_RKNSEL6_SHIFT        (16U)
#define VFCCU_0_FHFLTRKC0_1_RKNSEL6_WIDTH        (4U)
#define VFCCU_0_FHFLTRKC0_1_RKNSEL6(x)           (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHFLTRKC0_1_RKNSEL6_SHIFT)) & VFCCU_0_FHFLTRKC0_1_RKNSEL6_MASK)

#define VFCCU_0_FHFLTRKC0_1_RKNSEL7_MASK         (0xF000000U)
#define VFCCU_0_FHFLTRKC0_1_RKNSEL7_SHIFT        (24U)
#define VFCCU_0_FHFLTRKC0_1_RKNSEL7_WIDTH        (4U)
#define VFCCU_0_FHFLTRKC0_1_RKNSEL7(x)           (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHFLTRKC0_1_RKNSEL7_SHIFT)) & VFCCU_0_FHFLTRKC0_1_RKNSEL7_MASK)
/*! @} */

/*! @name FHFLTRKC0_2 - Fault Reaction Set Configuration */
/*! @{ */

#define VFCCU_0_FHFLTRKC0_2_RKNSEL8_MASK         (0xFU)
#define VFCCU_0_FHFLTRKC0_2_RKNSEL8_SHIFT        (0U)
#define VFCCU_0_FHFLTRKC0_2_RKNSEL8_WIDTH        (4U)
#define VFCCU_0_FHFLTRKC0_2_RKNSEL8(x)           (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHFLTRKC0_2_RKNSEL8_SHIFT)) & VFCCU_0_FHFLTRKC0_2_RKNSEL8_MASK)

#define VFCCU_0_FHFLTRKC0_2_RKNSEL9_MASK         (0xF00U)
#define VFCCU_0_FHFLTRKC0_2_RKNSEL9_SHIFT        (8U)
#define VFCCU_0_FHFLTRKC0_2_RKNSEL9_WIDTH        (4U)
#define VFCCU_0_FHFLTRKC0_2_RKNSEL9(x)           (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHFLTRKC0_2_RKNSEL9_SHIFT)) & VFCCU_0_FHFLTRKC0_2_RKNSEL9_MASK)

#define VFCCU_0_FHFLTRKC0_2_RKNSEL10_MASK        (0xF0000U)
#define VFCCU_0_FHFLTRKC0_2_RKNSEL10_SHIFT       (16U)
#define VFCCU_0_FHFLTRKC0_2_RKNSEL10_WIDTH       (4U)
#define VFCCU_0_FHFLTRKC0_2_RKNSEL10(x)          (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHFLTRKC0_2_RKNSEL10_SHIFT)) & VFCCU_0_FHFLTRKC0_2_RKNSEL10_MASK)

#define VFCCU_0_FHFLTRKC0_2_RKNSEL11_MASK        (0xF000000U)
#define VFCCU_0_FHFLTRKC0_2_RKNSEL11_SHIFT       (24U)
#define VFCCU_0_FHFLTRKC0_2_RKNSEL11_WIDTH       (4U)
#define VFCCU_0_FHFLTRKC0_2_RKNSEL11(x)          (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHFLTRKC0_2_RKNSEL11_SHIFT)) & VFCCU_0_FHFLTRKC0_2_RKNSEL11_MASK)
/*! @} */

/*! @name FHFLTRKC0_3 - Fault Reaction Set Configuration */
/*! @{ */

#define VFCCU_0_FHFLTRKC0_3_RKNSEL12_MASK        (0xFU)
#define VFCCU_0_FHFLTRKC0_3_RKNSEL12_SHIFT       (0U)
#define VFCCU_0_FHFLTRKC0_3_RKNSEL12_WIDTH       (4U)
#define VFCCU_0_FHFLTRKC0_3_RKNSEL12(x)          (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHFLTRKC0_3_RKNSEL12_SHIFT)) & VFCCU_0_FHFLTRKC0_3_RKNSEL12_MASK)

#define VFCCU_0_FHFLTRKC0_3_RKNSEL13_MASK        (0xF00U)
#define VFCCU_0_FHFLTRKC0_3_RKNSEL13_SHIFT       (8U)
#define VFCCU_0_FHFLTRKC0_3_RKNSEL13_WIDTH       (4U)
#define VFCCU_0_FHFLTRKC0_3_RKNSEL13(x)          (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHFLTRKC0_3_RKNSEL13_SHIFT)) & VFCCU_0_FHFLTRKC0_3_RKNSEL13_MASK)

#define VFCCU_0_FHFLTRKC0_3_RKNSEL14_MASK        (0xF0000U)
#define VFCCU_0_FHFLTRKC0_3_RKNSEL14_SHIFT       (16U)
#define VFCCU_0_FHFLTRKC0_3_RKNSEL14_WIDTH       (4U)
#define VFCCU_0_FHFLTRKC0_3_RKNSEL14(x)          (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHFLTRKC0_3_RKNSEL14_SHIFT)) & VFCCU_0_FHFLTRKC0_3_RKNSEL14_MASK)

#define VFCCU_0_FHFLTRKC0_3_RKNSEL15_MASK        (0xF000000U)
#define VFCCU_0_FHFLTRKC0_3_RKNSEL15_SHIFT       (24U)
#define VFCCU_0_FHFLTRKC0_3_RKNSEL15_WIDTH       (4U)
#define VFCCU_0_FHFLTRKC0_3_RKNSEL15(x)          (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHFLTRKC0_3_RKNSEL15_SHIFT)) & VFCCU_0_FHFLTRKC0_3_RKNSEL15_MASK)
/*! @} */

/*! @name FHFLTRKC0_4 - Fault Reaction Set Configuration */
/*! @{ */

#define VFCCU_0_FHFLTRKC0_4_RKNSEL16_MASK        (0xFU)
#define VFCCU_0_FHFLTRKC0_4_RKNSEL16_SHIFT       (0U)
#define VFCCU_0_FHFLTRKC0_4_RKNSEL16_WIDTH       (4U)
#define VFCCU_0_FHFLTRKC0_4_RKNSEL16(x)          (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHFLTRKC0_4_RKNSEL16_SHIFT)) & VFCCU_0_FHFLTRKC0_4_RKNSEL16_MASK)

