zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_VFCCU_0.h
#define VFCCU_0_FHIMRKC0_70_RKNEN17_MASK         (0x80000U)
#define VFCCU_0_FHIMRKC0_70_RKNEN17_SHIFT        (19U)
#define VFCCU_0_FHIMRKC0_70_RKNEN17_WIDTH        (1U)
#define VFCCU_0_FHIMRKC0_70_RKNEN17(x)           (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHIMRKC0_70_RKNEN17_SHIFT)) & VFCCU_0_FHIMRKC0_70_RKNEN17_MASK)

#define VFCCU_0_FHIMRKC0_70_RKNEN18_MASK         (0x100000U)
#define VFCCU_0_FHIMRKC0_70_RKNEN18_SHIFT        (20U)
#define VFCCU_0_FHIMRKC0_70_RKNEN18_WIDTH        (1U)
#define VFCCU_0_FHIMRKC0_70_RKNEN18(x)           (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHIMRKC0_70_RKNEN18_SHIFT)) & VFCCU_0_FHIMRKC0_70_RKNEN18_MASK)

#define VFCCU_0_FHIMRKC0_70_RKNEN19_MASK         (0x200000U)
#define VFCCU_0_FHIMRKC0_70_RKNEN19_SHIFT        (21U)
#define VFCCU_0_FHIMRKC0_70_RKNEN19_WIDTH        (1U)
#define VFCCU_0_FHIMRKC0_70_RKNEN19(x)           (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHIMRKC0_70_RKNEN19_SHIFT)) & VFCCU_0_FHIMRKC0_70_RKNEN19_MASK)

#define VFCCU_0_FHIMRKC0_70_RKNEN20_MASK         (0x400000U)
#define VFCCU_0_FHIMRKC0_70_RKNEN20_SHIFT        (22U)
#define VFCCU_0_FHIMRKC0_70_RKNEN20_WIDTH        (1U)
#define VFCCU_0_FHIMRKC0_70_RKNEN20(x)           (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHIMRKC0_70_RKNEN20_SHIFT)) & VFCCU_0_FHIMRKC0_70_RKNEN20_MASK)

#define VFCCU_0_FHIMRKC0_70_RKNEN21_MASK         (0x800000U)
#define VFCCU_0_FHIMRKC0_70_RKNEN21_SHIFT        (23U)
#define VFCCU_0_FHIMRKC0_70_RKNEN21_WIDTH        (1U)
#define VFCCU_0_FHIMRKC0_70_RKNEN21(x)           (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHIMRKC0_70_RKNEN21_SHIFT)) & VFCCU_0_FHIMRKC0_70_RKNEN21_MASK)

#define VFCCU_0_FHIMRKC0_70_RKNEN22_MASK         (0x1000000U)
#define VFCCU_0_FHIMRKC0_70_RKNEN22_SHIFT        (24U)
#define VFCCU_0_FHIMRKC0_70_RKNEN22_WIDTH        (1U)
#define VFCCU_0_FHIMRKC0_70_RKNEN22(x)           (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHIMRKC0_70_RKNEN22_SHIFT)) & VFCCU_0_FHIMRKC0_70_RKNEN22_MASK)

#define VFCCU_0_FHIMRKC0_70_RKNEN23_MASK         (0x2000000U)
#define VFCCU_0_FHIMRKC0_70_RKNEN23_SHIFT        (25U)
#define VFCCU_0_FHIMRKC0_70_RKNEN23_WIDTH        (1U)
#define VFCCU_0_FHIMRKC0_70_RKNEN23(x)           (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHIMRKC0_70_RKNEN23_SHIFT)) & VFCCU_0_FHIMRKC0_70_RKNEN23_MASK)

#define VFCCU_0_FHIMRKC0_70_RKNEN24_MASK         (0x4000000U)
#define VFCCU_0_FHIMRKC0_70_RKNEN24_SHIFT        (26U)
#define VFCCU_0_FHIMRKC0_70_RKNEN24_WIDTH        (1U)
#define VFCCU_0_FHIMRKC0_70_RKNEN24(x)           (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHIMRKC0_70_RKNEN24_SHIFT)) & VFCCU_0_FHIMRKC0_70_RKNEN24_MASK)

#define VFCCU_0_FHIMRKC0_70_RKNEN25_MASK         (0x8000000U)
#define VFCCU_0_FHIMRKC0_70_RKNEN25_SHIFT        (27U)
#define VFCCU_0_FHIMRKC0_70_RKNEN25_WIDTH        (1U)
#define VFCCU_0_FHIMRKC0_70_RKNEN25(x)           (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHIMRKC0_70_RKNEN25_SHIFT)) & VFCCU_0_FHIMRKC0_70_RKNEN25_MASK)

#define VFCCU_0_FHIMRKC0_70_RKNEN26_MASK         (0x10000000U)
#define VFCCU_0_FHIMRKC0_70_RKNEN26_SHIFT        (28U)
#define VFCCU_0_FHIMRKC0_70_RKNEN26_WIDTH        (1U)
#define VFCCU_0_FHIMRKC0_70_RKNEN26(x)           (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHIMRKC0_70_RKNEN26_SHIFT)) & VFCCU_0_FHIMRKC0_70_RKNEN26_MASK)

#define VFCCU_0_FHIMRKC0_70_RKNEN27_MASK         (0x20000000U)
#define VFCCU_0_FHIMRKC0_70_RKNEN27_SHIFT        (29U)
#define VFCCU_0_FHIMRKC0_70_RKNEN27_WIDTH        (1U)
#define VFCCU_0_FHIMRKC0_70_RKNEN27(x)           (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHIMRKC0_70_RKNEN27_SHIFT)) & VFCCU_0_FHIMRKC0_70_RKNEN27_MASK)

#define VFCCU_0_FHIMRKC0_70_RKNEN28_MASK         (0x40000000U)
#define VFCCU_0_FHIMRKC0_70_RKNEN28_SHIFT        (30U)
#define VFCCU_0_FHIMRKC0_70_RKNEN28_WIDTH        (1U)
#define VFCCU_0_FHIMRKC0_70_RKNEN28(x)           (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHIMRKC0_70_RKNEN28_SHIFT)) & VFCCU_0_FHIMRKC0_70_RKNEN28_MASK)

#define VFCCU_0_FHIMRKC0_70_RKNEN29_MASK         (0x80000000U)
#define VFCCU_0_FHIMRKC0_70_RKNEN29_SHIFT        (31U)
#define VFCCU_0_FHIMRKC0_70_RKNEN29_WIDTH        (1U)
#define VFCCU_0_FHIMRKC0_70_RKNEN29(x)           (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHIMRKC0_70_RKNEN29_SHIFT)) & VFCCU_0_FHIMRKC0_70_RKNEN29_MASK)
/*! @} */

/*! @name FHDLRKC0_70 - Delayed Reaction Configuration */
/*! @{ */

#define VFCCU_0_FHDLRKC0_70_EOUTEN0_MASK         (0x1U)
#define VFCCU_0_FHDLRKC0_70_EOUTEN0_SHIFT        (0U)
#define VFCCU_0_FHDLRKC0_70_EOUTEN0_WIDTH        (1U)
#define VFCCU_0_FHDLRKC0_70_EOUTEN0(x)           (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHDLRKC0_70_EOUTEN0_SHIFT)) & VFCCU_0_FHDLRKC0_70_EOUTEN0_MASK)

#define VFCCU_0_FHDLRKC0_70_EOUTEN1_MASK         (0x2U)
#define VFCCU_0_FHDLRKC0_70_EOUTEN1_SHIFT        (1U)
#define VFCCU_0_FHDLRKC0_70_EOUTEN1_WIDTH        (1U)
#define VFCCU_0_FHDLRKC0_70_EOUTEN1(x)           (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHDLRKC0_70_EOUTEN1_SHIFT)) & VFCCU_0_FHDLRKC0_70_EOUTEN1_MASK)

#define VFCCU_0_FHDLRKC0_70_RKNEN0_MASK          (0x4U)
#define VFCCU_0_FHDLRKC0_70_RKNEN0_SHIFT         (2U)
#define VFCCU_0_FHDLRKC0_70_RKNEN0_WIDTH         (1U)
#define VFCCU_0_FHDLRKC0_70_RKNEN0(x)            (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHDLRKC0_70_RKNEN0_SHIFT)) & VFCCU_0_FHDLRKC0_70_RKNEN0_MASK)

#define VFCCU_0_FHDLRKC0_70_RKNEN1_MASK          (0x8U)
#define VFCCU_0_FHDLRKC0_70_RKNEN1_SHIFT         (3U)
#define VFCCU_0_FHDLRKC0_70_RKNEN1_WIDTH         (1U)
#define VFCCU_0_FHDLRKC0_70_RKNEN1(x)            (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHDLRKC0_70_RKNEN1_SHIFT)) & VFCCU_0_FHDLRKC0_70_RKNEN1_MASK)

#define VFCCU_0_FHDLRKC0_70_RKNEN2_MASK          (0x10U)
#define VFCCU_0_FHDLRKC0_70_RKNEN2_SHIFT         (4U)
#define VFCCU_0_FHDLRKC0_70_RKNEN2_WIDTH         (1U)
#define VFCCU_0_FHDLRKC0_70_RKNEN2(x)            (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHDLRKC0_70_RKNEN2_SHIFT)) & VFCCU_0_FHDLRKC0_70_RKNEN2_MASK)

#define VFCCU_0_FHDLRKC0_70_RKNEN3_MASK          (0x20U)
#define VFCCU_0_FHDLRKC0_70_RKNEN3_SHIFT         (5U)
#define VFCCU_0_FHDLRKC0_70_RKNEN3_WIDTH         (1U)
#define VFCCU_0_FHDLRKC0_70_RKNEN3(x)            (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHDLRKC0_70_RKNEN3_SHIFT)) & VFCCU_0_FHDLRKC0_70_RKNEN3_MASK)

#define VFCCU_0_FHDLRKC0_70_RKNEN4_MASK          (0x40U)
#define VFCCU_0_FHDLRKC0_70_RKNEN4_SHIFT         (6U)
#define VFCCU_0_FHDLRKC0_70_RKNEN4_WIDTH         (1U)
#define VFCCU_0_FHDLRKC0_70_RKNEN4(x)            (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHDLRKC0_70_RKNEN4_SHIFT)) & VFCCU_0_FHDLRKC0_70_RKNEN4_MASK)

#define VFCCU_0_FHDLRKC0_70_RKNEN5_MASK          (0x80U)
#define VFCCU_0_FHDLRKC0_70_RKNEN5_SHIFT         (7U)
#define VFCCU_0_FHDLRKC0_70_RKNEN5_WIDTH         (1U)
#define VFCCU_0_FHDLRKC0_70_RKNEN5(x)            (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHDLRKC0_70_RKNEN5_SHIFT)) & VFCCU_0_FHDLRKC0_70_RKNEN5_MASK)

#define VFCCU_0_FHDLRKC0_70_RKNEN6_MASK          (0x100U)
#define VFCCU_0_FHDLRKC0_70_RKNEN6_SHIFT         (8U)
#define VFCCU_0_FHDLRKC0_70_RKNEN6_WIDTH         (1U)
#define VFCCU_0_FHDLRKC0_70_RKNEN6(x)            (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHDLRKC0_70_RKNEN6_SHIFT)) & VFCCU_0_FHDLRKC0_70_RKNEN6_MASK)

#define VFCCU_0_FHDLRKC0_70_RKNEN7_MASK          (0x200U)
#define VFCCU_0_FHDLRKC0_70_RKNEN7_SHIFT         (9U)
#define VFCCU_0_FHDLRKC0_70_RKNEN7_WIDTH         (1U)
#define VFCCU_0_FHDLRKC0_70_RKNEN7(x)            (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHDLRKC0_70_RKNEN7_SHIFT)) & VFCCU_0_FHDLRKC0_70_RKNEN7_MASK)

