zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_VFCCU_0.h
#define VFCCU_0_FHDLRKC0_110_RKNEN27_MASK        (0x20000000U)
#define VFCCU_0_FHDLRKC0_110_RKNEN27_SHIFT       (29U)
#define VFCCU_0_FHDLRKC0_110_RKNEN27_WIDTH       (1U)
#define VFCCU_0_FHDLRKC0_110_RKNEN27(x)          (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHDLRKC0_110_RKNEN27_SHIFT)) & VFCCU_0_FHDLRKC0_110_RKNEN27_MASK)

#define VFCCU_0_FHDLRKC0_110_RKNEN28_MASK        (0x40000000U)
#define VFCCU_0_FHDLRKC0_110_RKNEN28_SHIFT       (30U)
#define VFCCU_0_FHDLRKC0_110_RKNEN28_WIDTH       (1U)
#define VFCCU_0_FHDLRKC0_110_RKNEN28(x)          (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHDLRKC0_110_RKNEN28_SHIFT)) & VFCCU_0_FHDLRKC0_110_RKNEN28_MASK)

#define VFCCU_0_FHDLRKC0_110_RKNEN29_MASK        (0x80000000U)
#define VFCCU_0_FHDLRKC0_110_RKNEN29_SHIFT       (31U)
#define VFCCU_0_FHDLRKC0_110_RKNEN29_WIDTH       (1U)
#define VFCCU_0_FHDLRKC0_110_RKNEN29(x)          (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHDLRKC0_110_RKNEN29_SHIFT)) & VFCCU_0_FHDLRKC0_110_RKNEN29_MASK)
/*! @} */

/*! @name FHIMRKC0_120 - Immediate Reaction Configuration */
/*! @{ */

#define VFCCU_0_FHIMRKC0_120_EOUTEN0_MASK        (0x1U)
#define VFCCU_0_FHIMRKC0_120_EOUTEN0_SHIFT       (0U)
#define VFCCU_0_FHIMRKC0_120_EOUTEN0_WIDTH       (1U)
#define VFCCU_0_FHIMRKC0_120_EOUTEN0(x)          (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHIMRKC0_120_EOUTEN0_SHIFT)) & VFCCU_0_FHIMRKC0_120_EOUTEN0_MASK)

#define VFCCU_0_FHIMRKC0_120_EOUTEN1_MASK        (0x2U)
#define VFCCU_0_FHIMRKC0_120_EOUTEN1_SHIFT       (1U)
#define VFCCU_0_FHIMRKC0_120_EOUTEN1_WIDTH       (1U)
#define VFCCU_0_FHIMRKC0_120_EOUTEN1(x)          (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHIMRKC0_120_EOUTEN1_SHIFT)) & VFCCU_0_FHIMRKC0_120_EOUTEN1_MASK)

#define VFCCU_0_FHIMRKC0_120_RKNEN0_MASK         (0x4U)
#define VFCCU_0_FHIMRKC0_120_RKNEN0_SHIFT        (2U)
#define VFCCU_0_FHIMRKC0_120_RKNEN0_WIDTH        (1U)
#define VFCCU_0_FHIMRKC0_120_RKNEN0(x)           (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHIMRKC0_120_RKNEN0_SHIFT)) & VFCCU_0_FHIMRKC0_120_RKNEN0_MASK)

#define VFCCU_0_FHIMRKC0_120_RKNEN1_MASK         (0x8U)
#define VFCCU_0_FHIMRKC0_120_RKNEN1_SHIFT        (3U)
#define VFCCU_0_FHIMRKC0_120_RKNEN1_WIDTH        (1U)
#define VFCCU_0_FHIMRKC0_120_RKNEN1(x)           (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHIMRKC0_120_RKNEN1_SHIFT)) & VFCCU_0_FHIMRKC0_120_RKNEN1_MASK)

#define VFCCU_0_FHIMRKC0_120_RKNEN2_MASK         (0x10U)
#define VFCCU_0_FHIMRKC0_120_RKNEN2_SHIFT        (4U)
#define VFCCU_0_FHIMRKC0_120_RKNEN2_WIDTH        (1U)
#define VFCCU_0_FHIMRKC0_120_RKNEN2(x)           (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHIMRKC0_120_RKNEN2_SHIFT)) & VFCCU_0_FHIMRKC0_120_RKNEN2_MASK)

#define VFCCU_0_FHIMRKC0_120_RKNEN3_MASK         (0x20U)
#define VFCCU_0_FHIMRKC0_120_RKNEN3_SHIFT        (5U)
#define VFCCU_0_FHIMRKC0_120_RKNEN3_WIDTH        (1U)
#define VFCCU_0_FHIMRKC0_120_RKNEN3(x)           (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHIMRKC0_120_RKNEN3_SHIFT)) & VFCCU_0_FHIMRKC0_120_RKNEN3_MASK)

#define VFCCU_0_FHIMRKC0_120_RKNEN4_MASK         (0x40U)
#define VFCCU_0_FHIMRKC0_120_RKNEN4_SHIFT        (6U)
#define VFCCU_0_FHIMRKC0_120_RKNEN4_WIDTH        (1U)
#define VFCCU_0_FHIMRKC0_120_RKNEN4(x)           (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHIMRKC0_120_RKNEN4_SHIFT)) & VFCCU_0_FHIMRKC0_120_RKNEN4_MASK)

#define VFCCU_0_FHIMRKC0_120_RKNEN5_MASK         (0x80U)
#define VFCCU_0_FHIMRKC0_120_RKNEN5_SHIFT        (7U)
#define VFCCU_0_FHIMRKC0_120_RKNEN5_WIDTH        (1U)
#define VFCCU_0_FHIMRKC0_120_RKNEN5(x)           (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHIMRKC0_120_RKNEN5_SHIFT)) & VFCCU_0_FHIMRKC0_120_RKNEN5_MASK)

#define VFCCU_0_FHIMRKC0_120_RKNEN6_MASK         (0x100U)
#define VFCCU_0_FHIMRKC0_120_RKNEN6_SHIFT        (8U)
#define VFCCU_0_FHIMRKC0_120_RKNEN6_WIDTH        (1U)
#define VFCCU_0_FHIMRKC0_120_RKNEN6(x)           (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHIMRKC0_120_RKNEN6_SHIFT)) & VFCCU_0_FHIMRKC0_120_RKNEN6_MASK)

#define VFCCU_0_FHIMRKC0_120_RKNEN7_MASK         (0x200U)
#define VFCCU_0_FHIMRKC0_120_RKNEN7_SHIFT        (9U)
#define VFCCU_0_FHIMRKC0_120_RKNEN7_WIDTH        (1U)
#define VFCCU_0_FHIMRKC0_120_RKNEN7(x)           (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHIMRKC0_120_RKNEN7_SHIFT)) & VFCCU_0_FHIMRKC0_120_RKNEN7_MASK)

#define VFCCU_0_FHIMRKC0_120_RKNEN8_MASK         (0x400U)
#define VFCCU_0_FHIMRKC0_120_RKNEN8_SHIFT        (10U)
#define VFCCU_0_FHIMRKC0_120_RKNEN8_WIDTH        (1U)
#define VFCCU_0_FHIMRKC0_120_RKNEN8(x)           (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHIMRKC0_120_RKNEN8_SHIFT)) & VFCCU_0_FHIMRKC0_120_RKNEN8_MASK)

#define VFCCU_0_FHIMRKC0_120_RKNEN9_MASK         (0x800U)
#define VFCCU_0_FHIMRKC0_120_RKNEN9_SHIFT        (11U)
#define VFCCU_0_FHIMRKC0_120_RKNEN9_WIDTH        (1U)
#define VFCCU_0_FHIMRKC0_120_RKNEN9(x)           (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHIMRKC0_120_RKNEN9_SHIFT)) & VFCCU_0_FHIMRKC0_120_RKNEN9_MASK)

#define VFCCU_0_FHIMRKC0_120_RKNEN10_MASK        (0x1000U)
#define VFCCU_0_FHIMRKC0_120_RKNEN10_SHIFT       (12U)
#define VFCCU_0_FHIMRKC0_120_RKNEN10_WIDTH       (1U)
#define VFCCU_0_FHIMRKC0_120_RKNEN10(x)          (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHIMRKC0_120_RKNEN10_SHIFT)) & VFCCU_0_FHIMRKC0_120_RKNEN10_MASK)

#define VFCCU_0_FHIMRKC0_120_RKNEN11_MASK        (0x2000U)
#define VFCCU_0_FHIMRKC0_120_RKNEN11_SHIFT       (13U)
#define VFCCU_0_FHIMRKC0_120_RKNEN11_WIDTH       (1U)
#define VFCCU_0_FHIMRKC0_120_RKNEN11(x)          (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHIMRKC0_120_RKNEN11_SHIFT)) & VFCCU_0_FHIMRKC0_120_RKNEN11_MASK)

#define VFCCU_0_FHIMRKC0_120_RKNEN12_MASK        (0x4000U)
#define VFCCU_0_FHIMRKC0_120_RKNEN12_SHIFT       (14U)
#define VFCCU_0_FHIMRKC0_120_RKNEN12_WIDTH       (1U)
#define VFCCU_0_FHIMRKC0_120_RKNEN12(x)          (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHIMRKC0_120_RKNEN12_SHIFT)) & VFCCU_0_FHIMRKC0_120_RKNEN12_MASK)

#define VFCCU_0_FHIMRKC0_120_RKNEN13_MASK        (0x8000U)
#define VFCCU_0_FHIMRKC0_120_RKNEN13_SHIFT       (15U)
#define VFCCU_0_FHIMRKC0_120_RKNEN13_WIDTH       (1U)
#define VFCCU_0_FHIMRKC0_120_RKNEN13(x)          (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHIMRKC0_120_RKNEN13_SHIFT)) & VFCCU_0_FHIMRKC0_120_RKNEN13_MASK)

#define VFCCU_0_FHIMRKC0_120_RKNEN14_MASK        (0x10000U)
#define VFCCU_0_FHIMRKC0_120_RKNEN14_SHIFT       (16U)
#define VFCCU_0_FHIMRKC0_120_RKNEN14_WIDTH       (1U)
#define VFCCU_0_FHIMRKC0_120_RKNEN14(x)          (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHIMRKC0_120_RKNEN14_SHIFT)) & VFCCU_0_FHIMRKC0_120_RKNEN14_MASK)

#define VFCCU_0_FHIMRKC0_120_RKNEN15_MASK        (0x20000U)
#define VFCCU_0_FHIMRKC0_120_RKNEN15_SHIFT       (17U)
#define VFCCU_0_FHIMRKC0_120_RKNEN15_WIDTH       (1U)
#define VFCCU_0_FHIMRKC0_120_RKNEN15(x)          (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHIMRKC0_120_RKNEN15_SHIFT)) & VFCCU_0_FHIMRKC0_120_RKNEN15_MASK)

#define VFCCU_0_FHIMRKC0_120_RKNEN16_MASK        (0x40000U)
#define VFCCU_0_FHIMRKC0_120_RKNEN16_SHIFT       (18U)
#define VFCCU_0_FHIMRKC0_120_RKNEN16_WIDTH       (1U)
#define VFCCU_0_FHIMRKC0_120_RKNEN16(x)          (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHIMRKC0_120_RKNEN16_SHIFT)) & VFCCU_0_FHIMRKC0_120_RKNEN16_MASK)

