zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_VFCCU_0.h
#define VFCCU_0_FHIMRKC0_130_RKNEN1_MASK         (0x8U)
#define VFCCU_0_FHIMRKC0_130_RKNEN1_SHIFT        (3U)
#define VFCCU_0_FHIMRKC0_130_RKNEN1_WIDTH        (1U)
#define VFCCU_0_FHIMRKC0_130_RKNEN1(x)           (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHIMRKC0_130_RKNEN1_SHIFT)) & VFCCU_0_FHIMRKC0_130_RKNEN1_MASK)

#define VFCCU_0_FHIMRKC0_130_RKNEN2_MASK         (0x10U)
#define VFCCU_0_FHIMRKC0_130_RKNEN2_SHIFT        (4U)
#define VFCCU_0_FHIMRKC0_130_RKNEN2_WIDTH        (1U)
#define VFCCU_0_FHIMRKC0_130_RKNEN2(x)           (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHIMRKC0_130_RKNEN2_SHIFT)) & VFCCU_0_FHIMRKC0_130_RKNEN2_MASK)

#define VFCCU_0_FHIMRKC0_130_RKNEN3_MASK         (0x20U)
#define VFCCU_0_FHIMRKC0_130_RKNEN3_SHIFT        (5U)
#define VFCCU_0_FHIMRKC0_130_RKNEN3_WIDTH        (1U)
#define VFCCU_0_FHIMRKC0_130_RKNEN3(x)           (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHIMRKC0_130_RKNEN3_SHIFT)) & VFCCU_0_FHIMRKC0_130_RKNEN3_MASK)

#define VFCCU_0_FHIMRKC0_130_RKNEN4_MASK         (0x40U)
#define VFCCU_0_FHIMRKC0_130_RKNEN4_SHIFT        (6U)
#define VFCCU_0_FHIMRKC0_130_RKNEN4_WIDTH        (1U)
#define VFCCU_0_FHIMRKC0_130_RKNEN4(x)           (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHIMRKC0_130_RKNEN4_SHIFT)) & VFCCU_0_FHIMRKC0_130_RKNEN4_MASK)

#define VFCCU_0_FHIMRKC0_130_RKNEN5_MASK         (0x80U)
#define VFCCU_0_FHIMRKC0_130_RKNEN5_SHIFT        (7U)
#define VFCCU_0_FHIMRKC0_130_RKNEN5_WIDTH        (1U)
#define VFCCU_0_FHIMRKC0_130_RKNEN5(x)           (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHIMRKC0_130_RKNEN5_SHIFT)) & VFCCU_0_FHIMRKC0_130_RKNEN5_MASK)

#define VFCCU_0_FHIMRKC0_130_RKNEN6_MASK         (0x100U)
#define VFCCU_0_FHIMRKC0_130_RKNEN6_SHIFT        (8U)
#define VFCCU_0_FHIMRKC0_130_RKNEN6_WIDTH        (1U)
#define VFCCU_0_FHIMRKC0_130_RKNEN6(x)           (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHIMRKC0_130_RKNEN6_SHIFT)) & VFCCU_0_FHIMRKC0_130_RKNEN6_MASK)

#define VFCCU_0_FHIMRKC0_130_RKNEN7_MASK         (0x200U)
#define VFCCU_0_FHIMRKC0_130_RKNEN7_SHIFT        (9U)
#define VFCCU_0_FHIMRKC0_130_RKNEN7_WIDTH        (1U)
#define VFCCU_0_FHIMRKC0_130_RKNEN7(x)           (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHIMRKC0_130_RKNEN7_SHIFT)) & VFCCU_0_FHIMRKC0_130_RKNEN7_MASK)

#define VFCCU_0_FHIMRKC0_130_RKNEN8_MASK         (0x400U)
#define VFCCU_0_FHIMRKC0_130_RKNEN8_SHIFT        (10U)
#define VFCCU_0_FHIMRKC0_130_RKNEN8_WIDTH        (1U)
#define VFCCU_0_FHIMRKC0_130_RKNEN8(x)           (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHIMRKC0_130_RKNEN8_SHIFT)) & VFCCU_0_FHIMRKC0_130_RKNEN8_MASK)

#define VFCCU_0_FHIMRKC0_130_RKNEN9_MASK         (0x800U)
#define VFCCU_0_FHIMRKC0_130_RKNEN9_SHIFT        (11U)
#define VFCCU_0_FHIMRKC0_130_RKNEN9_WIDTH        (1U)
#define VFCCU_0_FHIMRKC0_130_RKNEN9(x)           (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHIMRKC0_130_RKNEN9_SHIFT)) & VFCCU_0_FHIMRKC0_130_RKNEN9_MASK)

#define VFCCU_0_FHIMRKC0_130_RKNEN10_MASK        (0x1000U)
#define VFCCU_0_FHIMRKC0_130_RKNEN10_SHIFT       (12U)
#define VFCCU_0_FHIMRKC0_130_RKNEN10_WIDTH       (1U)
#define VFCCU_0_FHIMRKC0_130_RKNEN10(x)          (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHIMRKC0_130_RKNEN10_SHIFT)) & VFCCU_0_FHIMRKC0_130_RKNEN10_MASK)

#define VFCCU_0_FHIMRKC0_130_RKNEN11_MASK        (0x2000U)
#define VFCCU_0_FHIMRKC0_130_RKNEN11_SHIFT       (13U)
#define VFCCU_0_FHIMRKC0_130_RKNEN11_WIDTH       (1U)
#define VFCCU_0_FHIMRKC0_130_RKNEN11(x)          (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHIMRKC0_130_RKNEN11_SHIFT)) & VFCCU_0_FHIMRKC0_130_RKNEN11_MASK)

#define VFCCU_0_FHIMRKC0_130_RKNEN12_MASK        (0x4000U)
#define VFCCU_0_FHIMRKC0_130_RKNEN12_SHIFT       (14U)
#define VFCCU_0_FHIMRKC0_130_RKNEN12_WIDTH       (1U)
#define VFCCU_0_FHIMRKC0_130_RKNEN12(x)          (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHIMRKC0_130_RKNEN12_SHIFT)) & VFCCU_0_FHIMRKC0_130_RKNEN12_MASK)

#define VFCCU_0_FHIMRKC0_130_RKNEN13_MASK        (0x8000U)
#define VFCCU_0_FHIMRKC0_130_RKNEN13_SHIFT       (15U)
#define VFCCU_0_FHIMRKC0_130_RKNEN13_WIDTH       (1U)
#define VFCCU_0_FHIMRKC0_130_RKNEN13(x)          (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHIMRKC0_130_RKNEN13_SHIFT)) & VFCCU_0_FHIMRKC0_130_RKNEN13_MASK)

#define VFCCU_0_FHIMRKC0_130_RKNEN14_MASK        (0x10000U)
#define VFCCU_0_FHIMRKC0_130_RKNEN14_SHIFT       (16U)
#define VFCCU_0_FHIMRKC0_130_RKNEN14_WIDTH       (1U)
#define VFCCU_0_FHIMRKC0_130_RKNEN14(x)          (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHIMRKC0_130_RKNEN14_SHIFT)) & VFCCU_0_FHIMRKC0_130_RKNEN14_MASK)

#define VFCCU_0_FHIMRKC0_130_RKNEN15_MASK        (0x20000U)
#define VFCCU_0_FHIMRKC0_130_RKNEN15_SHIFT       (17U)
#define VFCCU_0_FHIMRKC0_130_RKNEN15_WIDTH       (1U)
#define VFCCU_0_FHIMRKC0_130_RKNEN15(x)          (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHIMRKC0_130_RKNEN15_SHIFT)) & VFCCU_0_FHIMRKC0_130_RKNEN15_MASK)

#define VFCCU_0_FHIMRKC0_130_RKNEN16_MASK        (0x40000U)
#define VFCCU_0_FHIMRKC0_130_RKNEN16_SHIFT       (18U)
#define VFCCU_0_FHIMRKC0_130_RKNEN16_WIDTH       (1U)
#define VFCCU_0_FHIMRKC0_130_RKNEN16(x)          (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHIMRKC0_130_RKNEN16_SHIFT)) & VFCCU_0_FHIMRKC0_130_RKNEN16_MASK)

#define VFCCU_0_FHIMRKC0_130_RKNEN17_MASK        (0x80000U)
#define VFCCU_0_FHIMRKC0_130_RKNEN17_SHIFT       (19U)
#define VFCCU_0_FHIMRKC0_130_RKNEN17_WIDTH       (1U)
#define VFCCU_0_FHIMRKC0_130_RKNEN17(x)          (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHIMRKC0_130_RKNEN17_SHIFT)) & VFCCU_0_FHIMRKC0_130_RKNEN17_MASK)

#define VFCCU_0_FHIMRKC0_130_RKNEN18_MASK        (0x100000U)
#define VFCCU_0_FHIMRKC0_130_RKNEN18_SHIFT       (20U)
#define VFCCU_0_FHIMRKC0_130_RKNEN18_WIDTH       (1U)
#define VFCCU_0_FHIMRKC0_130_RKNEN18(x)          (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHIMRKC0_130_RKNEN18_SHIFT)) & VFCCU_0_FHIMRKC0_130_RKNEN18_MASK)

#define VFCCU_0_FHIMRKC0_130_RKNEN19_MASK        (0x200000U)
#define VFCCU_0_FHIMRKC0_130_RKNEN19_SHIFT       (21U)
#define VFCCU_0_FHIMRKC0_130_RKNEN19_WIDTH       (1U)
#define VFCCU_0_FHIMRKC0_130_RKNEN19(x)          (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHIMRKC0_130_RKNEN19_SHIFT)) & VFCCU_0_FHIMRKC0_130_RKNEN19_MASK)

#define VFCCU_0_FHIMRKC0_130_RKNEN20_MASK        (0x400000U)
#define VFCCU_0_FHIMRKC0_130_RKNEN20_SHIFT       (22U)
#define VFCCU_0_FHIMRKC0_130_RKNEN20_WIDTH       (1U)
#define VFCCU_0_FHIMRKC0_130_RKNEN20(x)          (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHIMRKC0_130_RKNEN20_SHIFT)) & VFCCU_0_FHIMRKC0_130_RKNEN20_MASK)

