zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_VFCCU_0.h
#define VFCCU_0_FHDLRKC0_130_RKNEN11_MASK        (0x2000U)
#define VFCCU_0_FHDLRKC0_130_RKNEN11_SHIFT       (13U)
#define VFCCU_0_FHDLRKC0_130_RKNEN11_WIDTH       (1U)
#define VFCCU_0_FHDLRKC0_130_RKNEN11(x)          (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHDLRKC0_130_RKNEN11_SHIFT)) & VFCCU_0_FHDLRKC0_130_RKNEN11_MASK)

#define VFCCU_0_FHDLRKC0_130_RKNEN12_MASK        (0x4000U)
#define VFCCU_0_FHDLRKC0_130_RKNEN12_SHIFT       (14U)
#define VFCCU_0_FHDLRKC0_130_RKNEN12_WIDTH       (1U)
#define VFCCU_0_FHDLRKC0_130_RKNEN12(x)          (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHDLRKC0_130_RKNEN12_SHIFT)) & VFCCU_0_FHDLRKC0_130_RKNEN12_MASK)

#define VFCCU_0_FHDLRKC0_130_RKNEN13_MASK        (0x8000U)
#define VFCCU_0_FHDLRKC0_130_RKNEN13_SHIFT       (15U)
#define VFCCU_0_FHDLRKC0_130_RKNEN13_WIDTH       (1U)
#define VFCCU_0_FHDLRKC0_130_RKNEN13(x)          (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHDLRKC0_130_RKNEN13_SHIFT)) & VFCCU_0_FHDLRKC0_130_RKNEN13_MASK)

#define VFCCU_0_FHDLRKC0_130_RKNEN14_MASK        (0x10000U)
#define VFCCU_0_FHDLRKC0_130_RKNEN14_SHIFT       (16U)
#define VFCCU_0_FHDLRKC0_130_RKNEN14_WIDTH       (1U)
#define VFCCU_0_FHDLRKC0_130_RKNEN14(x)          (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHDLRKC0_130_RKNEN14_SHIFT)) & VFCCU_0_FHDLRKC0_130_RKNEN14_MASK)

#define VFCCU_0_FHDLRKC0_130_RKNEN15_MASK        (0x20000U)
#define VFCCU_0_FHDLRKC0_130_RKNEN15_SHIFT       (17U)
#define VFCCU_0_FHDLRKC0_130_RKNEN15_WIDTH       (1U)
#define VFCCU_0_FHDLRKC0_130_RKNEN15(x)          (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHDLRKC0_130_RKNEN15_SHIFT)) & VFCCU_0_FHDLRKC0_130_RKNEN15_MASK)

#define VFCCU_0_FHDLRKC0_130_RKNEN16_MASK        (0x40000U)
#define VFCCU_0_FHDLRKC0_130_RKNEN16_SHIFT       (18U)
#define VFCCU_0_FHDLRKC0_130_RKNEN16_WIDTH       (1U)
#define VFCCU_0_FHDLRKC0_130_RKNEN16(x)          (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHDLRKC0_130_RKNEN16_SHIFT)) & VFCCU_0_FHDLRKC0_130_RKNEN16_MASK)

#define VFCCU_0_FHDLRKC0_130_RKNEN17_MASK        (0x80000U)
#define VFCCU_0_FHDLRKC0_130_RKNEN17_SHIFT       (19U)
#define VFCCU_0_FHDLRKC0_130_RKNEN17_WIDTH       (1U)
#define VFCCU_0_FHDLRKC0_130_RKNEN17(x)          (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHDLRKC0_130_RKNEN17_SHIFT)) & VFCCU_0_FHDLRKC0_130_RKNEN17_MASK)

#define VFCCU_0_FHDLRKC0_130_RKNEN18_MASK        (0x100000U)
#define VFCCU_0_FHDLRKC0_130_RKNEN18_SHIFT       (20U)
#define VFCCU_0_FHDLRKC0_130_RKNEN18_WIDTH       (1U)
#define VFCCU_0_FHDLRKC0_130_RKNEN18(x)          (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHDLRKC0_130_RKNEN18_SHIFT)) & VFCCU_0_FHDLRKC0_130_RKNEN18_MASK)

#define VFCCU_0_FHDLRKC0_130_RKNEN19_MASK        (0x200000U)
#define VFCCU_0_FHDLRKC0_130_RKNEN19_SHIFT       (21U)
#define VFCCU_0_FHDLRKC0_130_RKNEN19_WIDTH       (1U)
#define VFCCU_0_FHDLRKC0_130_RKNEN19(x)          (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHDLRKC0_130_RKNEN19_SHIFT)) & VFCCU_0_FHDLRKC0_130_RKNEN19_MASK)

#define VFCCU_0_FHDLRKC0_130_RKNEN20_MASK        (0x400000U)
#define VFCCU_0_FHDLRKC0_130_RKNEN20_SHIFT       (22U)
#define VFCCU_0_FHDLRKC0_130_RKNEN20_WIDTH       (1U)
#define VFCCU_0_FHDLRKC0_130_RKNEN20(x)          (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHDLRKC0_130_RKNEN20_SHIFT)) & VFCCU_0_FHDLRKC0_130_RKNEN20_MASK)

#define VFCCU_0_FHDLRKC0_130_RKNEN21_MASK        (0x800000U)
#define VFCCU_0_FHDLRKC0_130_RKNEN21_SHIFT       (23U)
#define VFCCU_0_FHDLRKC0_130_RKNEN21_WIDTH       (1U)
#define VFCCU_0_FHDLRKC0_130_RKNEN21(x)          (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHDLRKC0_130_RKNEN21_SHIFT)) & VFCCU_0_FHDLRKC0_130_RKNEN21_MASK)

#define VFCCU_0_FHDLRKC0_130_RKNEN22_MASK        (0x1000000U)
#define VFCCU_0_FHDLRKC0_130_RKNEN22_SHIFT       (24U)
#define VFCCU_0_FHDLRKC0_130_RKNEN22_WIDTH       (1U)
#define VFCCU_0_FHDLRKC0_130_RKNEN22(x)          (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHDLRKC0_130_RKNEN22_SHIFT)) & VFCCU_0_FHDLRKC0_130_RKNEN22_MASK)

#define VFCCU_0_FHDLRKC0_130_RKNEN23_MASK        (0x2000000U)
#define VFCCU_0_FHDLRKC0_130_RKNEN23_SHIFT       (25U)
#define VFCCU_0_FHDLRKC0_130_RKNEN23_WIDTH       (1U)
#define VFCCU_0_FHDLRKC0_130_RKNEN23(x)          (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHDLRKC0_130_RKNEN23_SHIFT)) & VFCCU_0_FHDLRKC0_130_RKNEN23_MASK)

#define VFCCU_0_FHDLRKC0_130_RKNEN24_MASK        (0x4000000U)
#define VFCCU_0_FHDLRKC0_130_RKNEN24_SHIFT       (26U)
#define VFCCU_0_FHDLRKC0_130_RKNEN24_WIDTH       (1U)
#define VFCCU_0_FHDLRKC0_130_RKNEN24(x)          (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHDLRKC0_130_RKNEN24_SHIFT)) & VFCCU_0_FHDLRKC0_130_RKNEN24_MASK)

#define VFCCU_0_FHDLRKC0_130_RKNEN25_MASK        (0x8000000U)
#define VFCCU_0_FHDLRKC0_130_RKNEN25_SHIFT       (27U)
#define VFCCU_0_FHDLRKC0_130_RKNEN25_WIDTH       (1U)
#define VFCCU_0_FHDLRKC0_130_RKNEN25(x)          (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHDLRKC0_130_RKNEN25_SHIFT)) & VFCCU_0_FHDLRKC0_130_RKNEN25_MASK)

#define VFCCU_0_FHDLRKC0_130_RKNEN26_MASK        (0x10000000U)
#define VFCCU_0_FHDLRKC0_130_RKNEN26_SHIFT       (28U)
#define VFCCU_0_FHDLRKC0_130_RKNEN26_WIDTH       (1U)
#define VFCCU_0_FHDLRKC0_130_RKNEN26(x)          (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHDLRKC0_130_RKNEN26_SHIFT)) & VFCCU_0_FHDLRKC0_130_RKNEN26_MASK)

#define VFCCU_0_FHDLRKC0_130_RKNEN27_MASK        (0x20000000U)
#define VFCCU_0_FHDLRKC0_130_RKNEN27_SHIFT       (29U)
#define VFCCU_0_FHDLRKC0_130_RKNEN27_WIDTH       (1U)
#define VFCCU_0_FHDLRKC0_130_RKNEN27(x)          (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHDLRKC0_130_RKNEN27_SHIFT)) & VFCCU_0_FHDLRKC0_130_RKNEN27_MASK)

#define VFCCU_0_FHDLRKC0_130_RKNEN28_MASK        (0x40000000U)
#define VFCCU_0_FHDLRKC0_130_RKNEN28_SHIFT       (30U)
#define VFCCU_0_FHDLRKC0_130_RKNEN28_WIDTH       (1U)
#define VFCCU_0_FHDLRKC0_130_RKNEN28(x)          (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHDLRKC0_130_RKNEN28_SHIFT)) & VFCCU_0_FHDLRKC0_130_RKNEN28_MASK)

#define VFCCU_0_FHDLRKC0_130_RKNEN29_MASK        (0x80000000U)
#define VFCCU_0_FHDLRKC0_130_RKNEN29_SHIFT       (31U)
#define VFCCU_0_FHDLRKC0_130_RKNEN29_WIDTH       (1U)
#define VFCCU_0_FHDLRKC0_130_RKNEN29(x)          (((uint32_t)(((uint32_t)(x)) << VFCCU_0_FHDLRKC0_130_RKNEN29_SHIFT)) & VFCCU_0_FHDLRKC0_130_RKNEN29_MASK)
/*! @} */

/*! @name FHIMRKC0_140 - Immediate Reaction Configuration */
/*! @{ */

